MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
extern volatile CCPR2Lbits_t CCPR2Lbits __at(0x298);
// bitfield macros
#define _CCPR2L_CCPR2L_POSN                                 0x0
#define _CCPR2L_CCPR2L_POSITION                             0x0
#define _CCPR2L_CCPR2L_SIZE                                 0x8
#define _CCPR2L_CCPR2L_LENGTH                               0x8
#define _CCPR2L_CCPR2L_MASK                                 0xFF

// Register: CCPR2H
#define CCPR2H CCPR2H
extern volatile unsigned char           CCPR2H              __at(0x299);
#ifndef _LIB_BUILD
asm("CCPR2H equ 0299h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR2H                 :8;
    };
} CCPR2Hbits_t;
extern volatile CCPR2Hbits_t CCPR2Hbits __at(0x299);
// bitfield macros
#define _CCPR2H_CCPR2H_POSN                                 0x0
#define _CCPR2H_CCPR2H_POSITION                             0x0
#define _CCPR2H_CCPR2H_SIZE                                 0x8
#define _CCPR2H_CCPR2H_LENGTH                               0x8
#define _CCPR2H_CCPR2H_MASK                                 0xFF

// Register: CCP2CON
#define CCP2CON CCP2CON
extern volatile unsigned char           CCP2CON             __at(0x29A);
#ifndef _LIB_BUILD
asm("CCP2CON equ 029Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2M                  :4;
        unsigned DC2B                   :2;
    };
    struct {
        unsigned CCP2M0                 :1;
        unsigned CCP2M1                 :1;
        unsigned CCP2M2                 :1;
        unsigned CCP2M3                 :1;
        unsigned DC2B0                  :1;
        unsigned DC2B1                  :1;
    };
} CCP2CONbits_t;
extern volatile CCP2CONbits_t CCP2CONbits __at(0x29A);
// bitfield macros
#define _CCP2CON_CCP2M_POSN                                 0x0
#define _CCP2CON_CCP2M_POSITION                             0x0
#define _CCP2CON_CCP2M_SIZE                                 0x4
#define _CCP2CON_CCP2M_LENGTH                               0x4
#define _CCP2CON_CCP2M_MASK                                 0xF
#define _CCP2CON_DC2B_POSN                                  0x4
#define _CCP2CON_DC2B_POSITION                              0x4
#define _CCP2CON_DC2B_SIZE                                  0x2
#define _CCP2CON_DC2B_LENGTH                                0x2
#define _CCP2CON_DC2B_MASK                                  0x30
#define _CCP2CON_CCP2M0_POSN                                0x0
#define _CCP2CON_CCP2M0_POSITION                            0x0
#define _CCP2CON_CCP2M0_SIZE                                0x1
#define _CCP2CON_CCP2M0_LENGTH                              0x1
#define _CCP2CON_CCP2M0_MASK                                0x1
#define _CCP2CON_CCP2M1_POSN                                0x1
#define _CCP2CON_CCP2M1_POSITION                            0x1
#define _CCP2CON_CCP2M1_SIZE                                0x1
#define _CCP2CON_CCP2M1_LENGTH                              0x1
#define _CCP2CON_CCP2M1_MASK                                0x2
#define _CCP2CON_CCP2M2_POSN                                0x2
#define _CCP2CON_CCP2M2_POSITION                            0x2
#define _CCP2CON_CCP2M2_SIZE                                0x1
#define _CCP2CON_CCP2M2_LENGTH                              0x1
#define _CCP2CON_CCP2M2_MASK                                0x4
#define _CCP2CON_CCP2M3_POSN                                0x3
#define _CCP2CON_CCP2M3_POSITION                            0x3
#define _CCP2CON_CCP2M3_SIZE                                0x1
#define _CCP2CON_CCP2M3_LENGTH                              0x1
#define _CCP2CON_CCP2M3_MASK                                0x8
#define _CCP2CON_DC2B0_POSN                                 0x4
#define _CCP2CON_DC2B0_POSITION                             0x4
#define _CCP2CON_DC2B0_SIZE                                 0x1
#define _CCP2CON_DC2B0_LENGTH                               0x1
#define _CCP2CON_DC2B0_MASK                                 0x10
#define _CCP2CON_DC2B1_POSN                                 0x5
#define _CCP2CON_DC2B1_POSITION                             0x5
#define _CCP2CON_DC2B1_SIZE                                 0x1
#define _CCP2CON_DC2B1_LENGTH                               0x1
#define _CCP2CON_DC2B1_MASK                                 0x20

// Register: SLRCONA
#define SLRCONA SLRCONA
extern volatile unsigned char           SLRCONA             __at(0x30C);
#ifndef _LIB_BUILD
asm("SLRCONA equ 030Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRCONA0               :1;
        unsigned SLRCONA1               :1;
        unsigned SLRCONA2               :1;
        unsigned SLRCONA3               :1;
        unsigned SLRCONA4               :1;
        unsigned SLRCONA5               :1;
        unsigned SLRCONA6               :1;
        unsigned SLRCONA7               :1;
    };
    struct {
        unsigned SLRCONA                :8;
    };
} SLRCONAbits_t;
extern volatile SLRCONAbits_t SLRCONAbits __at(0x30C);
// bitfield macros
#define _SLRCONA_SLRCONA0_POSN                              0x0
#define _SLRCONA_SLRCONA0_POSITION                          0x0
#define _SLRCONA_SLRCONA0_SIZE                              0x1
#define _SLRCONA_SLRCONA0_LENGTH                            0x1
#define _SLRCONA_SLRCONA0_MASK                              0x1
#define _SLRCONA_SLRCONA1_POSN                              0x1
#define _SLRCONA_SLRCONA1_POSITION                          0x1
#define _SLRCONA_SLRCONA1_SIZE                              0x1
#define _SLRCONA_SLRCONA1_LENGTH                            0x1
#define _SLRCONA_SLRCONA1_MASK                              0x2
#define _SLRCONA_SLRCONA2_POSN                              0x2
#define _SLRCONA_SLRCONA2_POSITION                          0x2
#define _SLRCONA_SLRCONA2_SIZE                              0x1
#define _SLRCONA_SLRCONA2_LENGTH                            0x1
#define _SLRCONA_SLRCONA2_MASK                              0x4
#define _SLRCONA_SLRCONA3_POSN                              0x3
#define _SLRCONA_SLRCONA3_POSITION                          0x3
#define _SLRCONA_SLRCONA3_SIZE                              0x1
#define _SLRCONA_SLRCONA3_LENGTH                            0x1
#define _SLRCONA_SLRCONA3_MASK                              0x8
#define _SLRCONA_SLRCONA4_POSN                              0x4
#define _SLRCONA_SLRCONA4_POSITION                          0x4
#define _SLRCONA_SLRCONA4_SIZE                              0x1
#define _SLRCONA_SLRCONA4_LENGTH                            0x1
#define _SLRCONA_SLRCONA4_MASK                              0x10
#define _SLRCONA_SLRCONA5_POSN                              0x5
#define _SLRCONA_SLRCONA5_POSITION                          0x5
#define _SLRCONA_SLRCONA5_SIZE                              0x1
#define _SLRCONA_SLRCONA5_LENGTH                            0x1
#define _SLRCONA_SLRCONA5_MASK                              0x20
#define _SLRCONA_SLRCONA6_POSN                              0x6
#define _SLRCONA_SLRCONA6_POSITION                          0x6
#define _SLRCONA_SLRCONA6_SIZE                              0x1
#define _SLRCONA_SLRCONA6_LENGTH                            0x1
#define _SLRCONA_SLRCONA6_MASK                              0x40
#define _SLRCONA_SLRCONA7_POSN                              0x7
#define _SLRCONA_SLRCONA7_POSITION                          0x7
#define _SLRCONA_SLRCONA7_SIZE                              0x1
#define _SLRCONA_SLRCONA7_LENGTH                            0x1
#define _SLRCONA_SLRCONA7_MASK                              0x80
#define _SLRCONA_SLRCONA_POSN                               0x0
#define _SLRCONA_SLRCONA_POSITION                           0x0
#define _SLRCONA_SLRCONA_SIZE                               0x8
#define _SLRCONA_SLRCONA_LENGTH                             0x8
#define _SLRCONA_SLRCONA_MASK                               0xFF

// Register: SLRCONB
#define SLRCONB SLRCONB
extern volatile unsigned char           SLRCONB             __at(0x30D);
#ifndef _LIB_BUILD
asm("SLRCONB equ 030Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRCONB0               :1;
        unsigned SLRCONB1               :1;
        unsigned SLRCONB2               :1;
        unsigned SLRCONB3               :1;
        unsigned SLRCONB4               :1;
        unsigned SLRCONB5               :1;
        unsigned SLRCONB6               :1;
        unsigned SLRCONB7               :1;
    };
    struct {
        unsigned SLRCONB                :8;
    };
} SLRCONBbits_t;
