MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
extern volatile PSMC1BLKRbits_t PSMC1BLKRbits __at(0xEAB);
// bitfield macros
#define _PSMC1BLKR_PSMC1BLKR0_POSN                          0x0
#define _PSMC1BLKR_PSMC1BLKR0_POSITION                      0x0
#define _PSMC1BLKR_PSMC1BLKR0_SIZE                          0x1
#define _PSMC1BLKR_PSMC1BLKR0_LENGTH                        0x1
#define _PSMC1BLKR_PSMC1BLKR0_MASK                          0x1
#define _PSMC1BLKR_PSMC1BLKR1_POSN                          0x1
#define _PSMC1BLKR_PSMC1BLKR1_POSITION                      0x1
#define _PSMC1BLKR_PSMC1BLKR1_SIZE                          0x1
#define _PSMC1BLKR_PSMC1BLKR1_LENGTH                        0x1
#define _PSMC1BLKR_PSMC1BLKR1_MASK                          0x2
#define _PSMC1BLKR_PSMC1BLKR2_POSN                          0x2
#define _PSMC1BLKR_PSMC1BLKR2_POSITION                      0x2
#define _PSMC1BLKR_PSMC1BLKR2_SIZE                          0x1
#define _PSMC1BLKR_PSMC1BLKR2_LENGTH                        0x1
#define _PSMC1BLKR_PSMC1BLKR2_MASK                          0x4
#define _PSMC1BLKR_PSMC1BLKR3_POSN                          0x3
#define _PSMC1BLKR_PSMC1BLKR3_POSITION                      0x3
#define _PSMC1BLKR_PSMC1BLKR3_SIZE                          0x1
#define _PSMC1BLKR_PSMC1BLKR3_LENGTH                        0x1
#define _PSMC1BLKR_PSMC1BLKR3_MASK                          0x8
#define _PSMC1BLKR_PSMC1BLKR4_POSN                          0x4
#define _PSMC1BLKR_PSMC1BLKR4_POSITION                      0x4
#define _PSMC1BLKR_PSMC1BLKR4_SIZE                          0x1
#define _PSMC1BLKR_PSMC1BLKR4_LENGTH                        0x1
#define _PSMC1BLKR_PSMC1BLKR4_MASK                          0x10
#define _PSMC1BLKR_PSMC1BLKR5_POSN                          0x5
#define _PSMC1BLKR_PSMC1BLKR5_POSITION                      0x5
#define _PSMC1BLKR_PSMC1BLKR5_SIZE                          0x1
#define _PSMC1BLKR_PSMC1BLKR5_LENGTH                        0x1
#define _PSMC1BLKR_PSMC1BLKR5_MASK                          0x20
#define _PSMC1BLKR_PSMC1BLKR6_POSN                          0x6
#define _PSMC1BLKR_PSMC1BLKR6_POSITION                      0x6
#define _PSMC1BLKR_PSMC1BLKR6_SIZE                          0x1
#define _PSMC1BLKR_PSMC1BLKR6_LENGTH                        0x1
#define _PSMC1BLKR_PSMC1BLKR6_MASK                          0x40
#define _PSMC1BLKR_PSMC1BLKR7_POSN                          0x7
#define _PSMC1BLKR_PSMC1BLKR7_POSITION                      0x7
#define _PSMC1BLKR_PSMC1BLKR7_SIZE                          0x1
#define _PSMC1BLKR_PSMC1BLKR7_LENGTH                        0x1
#define _PSMC1BLKR_PSMC1BLKR7_MASK                          0x80

// Register: PSMC1BLKF
#define PSMC1BLKF PSMC1BLKF
extern volatile unsigned char           PSMC1BLKF           __at(0xEAC);
#ifndef _LIB_BUILD
asm("PSMC1BLKF equ 0EACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1BLKF0             :1;
        unsigned PSMC1BLKF1             :1;
        unsigned PSMC1BLKF2             :1;
        unsigned PSMC1BLKF3             :1;
        unsigned PSMC1BLKF4             :1;
        unsigned PSMC1BLKF5             :1;
        unsigned PSMC1BLKF6             :1;
        unsigned PSMC1BLKF7             :1;
    };
} PSMC1BLKFbits_t;
extern volatile PSMC1BLKFbits_t PSMC1BLKFbits __at(0xEAC);
// bitfield macros
#define _PSMC1BLKF_PSMC1BLKF0_POSN                          0x0
#define _PSMC1BLKF_PSMC1BLKF0_POSITION                      0x0
#define _PSMC1BLKF_PSMC1BLKF0_SIZE                          0x1
#define _PSMC1BLKF_PSMC1BLKF0_LENGTH                        0x1
#define _PSMC1BLKF_PSMC1BLKF0_MASK                          0x1
#define _PSMC1BLKF_PSMC1BLKF1_POSN                          0x1
#define _PSMC1BLKF_PSMC1BLKF1_POSITION                      0x1
#define _PSMC1BLKF_PSMC1BLKF1_SIZE                          0x1
#define _PSMC1BLKF_PSMC1BLKF1_LENGTH                        0x1
#define _PSMC1BLKF_PSMC1BLKF1_MASK                          0x2
#define _PSMC1BLKF_PSMC1BLKF2_POSN                          0x2
#define _PSMC1BLKF_PSMC1BLKF2_POSITION                      0x2
#define _PSMC1BLKF_PSMC1BLKF2_SIZE                          0x1
#define _PSMC1BLKF_PSMC1BLKF2_LENGTH                        0x1
#define _PSMC1BLKF_PSMC1BLKF2_MASK                          0x4
#define _PSMC1BLKF_PSMC1BLKF3_POSN                          0x3
#define _PSMC1BLKF_PSMC1BLKF3_POSITION                      0x3
#define _PSMC1BLKF_PSMC1BLKF3_SIZE                          0x1
#define _PSMC1BLKF_PSMC1BLKF3_LENGTH                        0x1
#define _PSMC1BLKF_PSMC1BLKF3_MASK                          0x8
#define _PSMC1BLKF_PSMC1BLKF4_POSN                          0x4
#define _PSMC1BLKF_PSMC1BLKF4_POSITION                      0x4
#define _PSMC1BLKF_PSMC1BLKF4_SIZE                          0x1
#define _PSMC1BLKF_PSMC1BLKF4_LENGTH                        0x1
#define _PSMC1BLKF_PSMC1BLKF4_MASK                          0x10
#define _PSMC1BLKF_PSMC1BLKF5_POSN                          0x5
#define _PSMC1BLKF_PSMC1BLKF5_POSITION                      0x5
#define _PSMC1BLKF_PSMC1BLKF5_SIZE                          0x1
#define _PSMC1BLKF_PSMC1BLKF5_LENGTH                        0x1
#define _PSMC1BLKF_PSMC1BLKF5_MASK                          0x20
#define _PSMC1BLKF_PSMC1BLKF6_POSN                          0x6
#define _PSMC1BLKF_PSMC1BLKF6_POSITION                      0x6
#define _PSMC1BLKF_PSMC1BLKF6_SIZE                          0x1
#define _PSMC1BLKF_PSMC1BLKF6_LENGTH                        0x1
#define _PSMC1BLKF_PSMC1BLKF6_MASK                          0x40
#define _PSMC1BLKF_PSMC1BLKF7_POSN                          0x7
#define _PSMC1BLKF_PSMC1BLKF7_POSITION                      0x7
#define _PSMC1BLKF_PSMC1BLKF7_SIZE                          0x1
#define _PSMC1BLKF_PSMC1BLKF7_LENGTH                        0x1
#define _PSMC1BLKF_PSMC1BLKF7_MASK                          0x80

// Register: PSMC1FFA
#define PSMC1FFA PSMC1FFA
extern volatile unsigned char           PSMC1FFA            __at(0xEAD);
#ifndef _LIB_BUILD
asm("PSMC1FFA equ 0EADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC1FFA0              :1;
        unsigned PSMC1FFA1              :1;
        unsigned PSMC1FFA2              :1;
        unsigned PSMC1FFA3              :1;
    };
} PSMC1FFAbits_t;
extern volatile PSMC1FFAbits_t PSMC1FFAbits __at(0xEAD);
// bitfield macros
#define _PSMC1FFA_PSMC1FFA0_POSN                            0x0
#define _PSMC1FFA_PSMC1FFA0_POSITION                        0x0
#define _PSMC1FFA_PSMC1FFA0_SIZE                            0x1
#define _PSMC1FFA_PSMC1FFA0_LENGTH                          0x1
#define _PSMC1FFA_PSMC1FFA0_MASK                            0x1
#define _PSMC1FFA_PSMC1FFA1_POSN                            0x1
#define _PSMC1FFA_PSMC1FFA1_POSITION                        0x1
#define _PSMC1FFA_PSMC1FFA1_SIZE                            0x1
#define _PSMC1FFA_PSMC1FFA1_LENGTH                          0x1
#define _PSMC1FFA_PSMC1FFA1_MASK                            0x2
#define _PSMC1FFA_PSMC1FFA2_POSN                            0x2
#define _PSMC1FFA_PSMC1FFA2_POSITION                        0x2
#define _PSMC1FFA_PSMC1FFA2_SIZE                            0x1
#define _PSMC1FFA_PSMC1FFA2_LENGTH                          0x1
#define _PSMC1FFA_PSMC1FFA2_MASK                            0x4
#define _PSMC1FFA_PSMC1FFA3_POSN                            0x3
#define _PSMC1FFA_PSMC1FFA3_POSITION                        0x3
#define _PSMC1FFA_PSMC1FFA3_SIZE                            0x1
#define _PSMC1FFA_PSMC1FFA3_LENGTH                          0x1
#define _PSMC1FFA_PSMC1FFA3_MASK                            0x8

// Register: PSMC1STR0
#define PSMC1STR0 PSMC1STR0
extern volatile unsigned char           PSMC1STR0           __at(0xEAE);
#ifndef _LIB_BUILD
asm("PSMC1STR0 equ 0EAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1STRA                 :1;
        unsigned P1STRB                 :1;
        unsigned P1STRC                 :1;
        unsigned P1STRD                 :1;
        unsigned P1STRE                 :1;
        unsigned P1STRF                 :1;
    };
} PSMC1STR0bits_t;
