MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
extern volatile PSMC2STR0bits_t PSMC2STR0bits __at(0xECE);
// bitfield macros
#define _PSMC2STR0_P2STRA_POSN                              0x0
#define _PSMC2STR0_P2STRA_POSITION                          0x0
#define _PSMC2STR0_P2STRA_SIZE                              0x1
#define _PSMC2STR0_P2STRA_LENGTH                            0x1
#define _PSMC2STR0_P2STRA_MASK                              0x1
#define _PSMC2STR0_P2STRB_POSN                              0x1
#define _PSMC2STR0_P2STRB_POSITION                          0x1
#define _PSMC2STR0_P2STRB_SIZE                              0x1
#define _PSMC2STR0_P2STRB_LENGTH                            0x1
#define _PSMC2STR0_P2STRB_MASK                              0x2

// Register: PSMC2STR1
#define PSMC2STR1 PSMC2STR1
extern volatile unsigned char           PSMC2STR1           __at(0xECF);
#ifndef _LIB_BUILD
asm("PSMC2STR1 equ 0ECFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2HSMEN                :1;
        unsigned P2LSMEN                :1;
        unsigned                        :5;
        unsigned P2SSYNC                :1;
    };
} PSMC2STR1bits_t;
extern volatile PSMC2STR1bits_t PSMC2STR1bits __at(0xECF);
// bitfield macros
#define _PSMC2STR1_P2HSMEN_POSN                             0x0
#define _PSMC2STR1_P2HSMEN_POSITION                         0x0
#define _PSMC2STR1_P2HSMEN_SIZE                             0x1
#define _PSMC2STR1_P2HSMEN_LENGTH                           0x1
#define _PSMC2STR1_P2HSMEN_MASK                             0x1
#define _PSMC2STR1_P2LSMEN_POSN                             0x1
#define _PSMC2STR1_P2LSMEN_POSITION                         0x1
#define _PSMC2STR1_P2LSMEN_SIZE                             0x1
#define _PSMC2STR1_P2LSMEN_LENGTH                           0x1
#define _PSMC2STR1_P2LSMEN_MASK                             0x2
#define _PSMC2STR1_P2SSYNC_POSN                             0x7
#define _PSMC2STR1_P2SSYNC_POSITION                         0x7
#define _PSMC2STR1_P2SSYNC_SIZE                             0x1
#define _PSMC2STR1_P2SSYNC_LENGTH                           0x1
#define _PSMC2STR1_P2SSYNC_MASK                             0x80

// Register: PSMC3CON
#define PSMC3CON PSMC3CON
extern volatile unsigned char           PSMC3CON            __at(0xED1);
#ifndef _LIB_BUILD
asm("PSMC3CON equ 0ED1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3MODE                 :4;
        unsigned P3DBRE                 :1;
        unsigned P3DBFE                 :1;
        unsigned PSMC3LD                :1;
        unsigned PSMC3EN                :1;
    };
    struct {
        unsigned P3MODE0                :1;
        unsigned P3MODE1                :1;
        unsigned P3MODE2                :1;
        unsigned P3MODE3                :1;
    };
} PSMC3CONbits_t;
extern volatile PSMC3CONbits_t PSMC3CONbits __at(0xED1);
// bitfield macros
#define _PSMC3CON_P3MODE_POSN                               0x0
#define _PSMC3CON_P3MODE_POSITION                           0x0
#define _PSMC3CON_P3MODE_SIZE                               0x4
#define _PSMC3CON_P3MODE_LENGTH                             0x4
#define _PSMC3CON_P3MODE_MASK                               0xF
#define _PSMC3CON_P3DBRE_POSN                               0x4
#define _PSMC3CON_P3DBRE_POSITION                           0x4
#define _PSMC3CON_P3DBRE_SIZE                               0x1
#define _PSMC3CON_P3DBRE_LENGTH                             0x1
#define _PSMC3CON_P3DBRE_MASK                               0x10
#define _PSMC3CON_P3DBFE_POSN                               0x5
#define _PSMC3CON_P3DBFE_POSITION                           0x5
#define _PSMC3CON_P3DBFE_SIZE                               0x1
#define _PSMC3CON_P3DBFE_LENGTH                             0x1
#define _PSMC3CON_P3DBFE_MASK                               0x20
#define _PSMC3CON_PSMC3LD_POSN                              0x6
#define _PSMC3CON_PSMC3LD_POSITION                          0x6
#define _PSMC3CON_PSMC3LD_SIZE                              0x1
#define _PSMC3CON_PSMC3LD_LENGTH                            0x1
#define _PSMC3CON_PSMC3LD_MASK                              0x40
#define _PSMC3CON_PSMC3EN_POSN                              0x7
#define _PSMC3CON_PSMC3EN_POSITION                          0x7
#define _PSMC3CON_PSMC3EN_SIZE                              0x1
#define _PSMC3CON_PSMC3EN_LENGTH                            0x1
#define _PSMC3CON_PSMC3EN_MASK                              0x80
#define _PSMC3CON_P3MODE0_POSN                              0x0
#define _PSMC3CON_P3MODE0_POSITION                          0x0
#define _PSMC3CON_P3MODE0_SIZE                              0x1
#define _PSMC3CON_P3MODE0_LENGTH                            0x1
#define _PSMC3CON_P3MODE0_MASK                              0x1
#define _PSMC3CON_P3MODE1_POSN                              0x1
#define _PSMC3CON_P3MODE1_POSITION                          0x1
#define _PSMC3CON_P3MODE1_SIZE                              0x1
#define _PSMC3CON_P3MODE1_LENGTH                            0x1
#define _PSMC3CON_P3MODE1_MASK                              0x2
#define _PSMC3CON_P3MODE2_POSN                              0x2
#define _PSMC3CON_P3MODE2_POSITION                          0x2
#define _PSMC3CON_P3MODE2_SIZE                              0x1
#define _PSMC3CON_P3MODE2_LENGTH                            0x1
#define _PSMC3CON_P3MODE2_MASK                              0x4
#define _PSMC3CON_P3MODE3_POSN                              0x3
#define _PSMC3CON_P3MODE3_POSITION                          0x3
#define _PSMC3CON_P3MODE3_SIZE                              0x1
#define _PSMC3CON_P3MODE3_LENGTH                            0x1
#define _PSMC3CON_P3MODE3_MASK                              0x8

// Register: PSMC3MDL
#define PSMC3MDL PSMC3MDL
extern volatile unsigned char           PSMC3MDL            __at(0xED2);
#ifndef _LIB_BUILD
asm("PSMC3MDL equ 0ED2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3MSRC                 :4;
        unsigned                        :1;
        unsigned P3MDLBIT               :1;
        unsigned P3MDLPOL               :1;
        unsigned P3MDLEN                :1;
    };
    struct {
        unsigned P3MSRC0                :1;
        unsigned P3MSRC1                :1;
        unsigned P3MSRC2                :1;
        unsigned P3MSRC3                :1;
    };
} PSMC3MDLbits_t;
extern volatile PSMC3MDLbits_t PSMC3MDLbits __at(0xED2);
// bitfield macros
#define _PSMC3MDL_P3MSRC_POSN                               0x0
#define _PSMC3MDL_P3MSRC_POSITION                           0x0
#define _PSMC3MDL_P3MSRC_SIZE                               0x4
#define _PSMC3MDL_P3MSRC_LENGTH                             0x4
#define _PSMC3MDL_P3MSRC_MASK                               0xF
#define _PSMC3MDL_P3MDLBIT_POSN                             0x5
#define _PSMC3MDL_P3MDLBIT_POSITION                         0x5
#define _PSMC3MDL_P3MDLBIT_SIZE                             0x1
#define _PSMC3MDL_P3MDLBIT_LENGTH                           0x1
#define _PSMC3MDL_P3MDLBIT_MASK                             0x20
#define _PSMC3MDL_P3MDLPOL_POSN                             0x6
#define _PSMC3MDL_P3MDLPOL_POSITION                         0x6
#define _PSMC3MDL_P3MDLPOL_SIZE                             0x1
#define _PSMC3MDL_P3MDLPOL_LENGTH                           0x1
#define _PSMC3MDL_P3MDLPOL_MASK                             0x40
#define _PSMC3MDL_P3MDLEN_POSN                              0x7
#define _PSMC3MDL_P3MDLEN_POSITION                          0x7
#define _PSMC3MDL_P3MDLEN_SIZE                              0x1
#define _PSMC3MDL_P3MDLEN_LENGTH                            0x1
#define _PSMC3MDL_P3MDLEN_MASK                              0x80
#define _PSMC3MDL_P3MSRC0_POSN                              0x0
#define _PSMC3MDL_P3MSRC0_POSITION                          0x0
#define _PSMC3MDL_P3MSRC0_SIZE                              0x1
#define _PSMC3MDL_P3MSRC0_LENGTH                            0x1
#define _PSMC3MDL_P3MSRC0_MASK                              0x1
#define _PSMC3MDL_P3MSRC1_POSN                              0x1
#define _PSMC3MDL_P3MSRC1_POSITION                          0x1
#define _PSMC3MDL_P3MSRC1_SIZE                              0x1
#define _PSMC3MDL_P3MSRC1_LENGTH                            0x1
#define _PSMC3MDL_P3MSRC1_MASK                              0x2
#define _PSMC3MDL_P3MSRC2_POSN                              0x2
#define _PSMC3MDL_P3MSRC2_POSITION                          0x2
#define _PSMC3MDL_P3MSRC2_SIZE                              0x1
#define _PSMC3MDL_P3MSRC2_LENGTH                            0x1
#define _PSMC3MDL_P3MSRC2_MASK                              0x4
#define _PSMC3MDL_P3MSRC3_POSN                              0x3
#define _PSMC3MDL_P3MSRC3_POSITION                          0x3
#define _PSMC3MDL_P3MSRC3_SIZE                              0x1
#define _PSMC3MDL_P3MSRC3_LENGTH                            0x1
#define _PSMC3MDL_P3MSRC3_MASK                              0x8

// Register: PSMC3SYNC
#define PSMC3SYNC PSMC3SYNC
extern volatile unsigned char           PSMC3SYNC           __at(0xED3);
#ifndef _LIB_BUILD
asm("PSMC3SYNC equ 0ED3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3SYNC0                :1;
        unsigned P3SYNC1                :1;
        unsigned P3SYNC2                :1;
        unsigned                        :2;
        unsigned P3DCPOL                :1;
        unsigned P3PRPOL                :1;
        unsigned P3POFST                :1;
    };
} PSMC3SYNCbits_t;
