MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
extern volatile PSMC3POLbits_t PSMC3POLbits __at(0xED6);
// bitfield macros
#define _PSMC3POL_P3POLA_POSN                               0x0
#define _PSMC3POL_P3POLA_POSITION                           0x0
#define _PSMC3POL_P3POLA_SIZE                               0x1
#define _PSMC3POL_P3POLA_LENGTH                             0x1
#define _PSMC3POL_P3POLA_MASK                               0x1
#define _PSMC3POL_P3POLB_POSN                               0x1
#define _PSMC3POL_P3POLB_POSITION                           0x1
#define _PSMC3POL_P3POLB_SIZE                               0x1
#define _PSMC3POL_P3POLB_LENGTH                             0x1
#define _PSMC3POL_P3POLB_MASK                               0x2
#define _PSMC3POL_P3POLC_POSN                               0x2
#define _PSMC3POL_P3POLC_POSITION                           0x2
#define _PSMC3POL_P3POLC_SIZE                               0x1
#define _PSMC3POL_P3POLC_LENGTH                             0x1
#define _PSMC3POL_P3POLC_MASK                               0x4
#define _PSMC3POL_P3POLD_POSN                               0x3
#define _PSMC3POL_P3POLD_POSITION                           0x3
#define _PSMC3POL_P3POLD_SIZE                               0x1
#define _PSMC3POL_P3POLD_LENGTH                             0x1
#define _PSMC3POL_P3POLD_MASK                               0x8
#define _PSMC3POL_P3POLE_POSN                               0x4
#define _PSMC3POL_P3POLE_POSITION                           0x4
#define _PSMC3POL_P3POLE_SIZE                               0x1
#define _PSMC3POL_P3POLE_LENGTH                             0x1
#define _PSMC3POL_P3POLE_MASK                               0x10
#define _PSMC3POL_P3POLF_POSN                               0x5
#define _PSMC3POL_P3POLF_POSITION                           0x5
#define _PSMC3POL_P3POLF_SIZE                               0x1
#define _PSMC3POL_P3POLF_LENGTH                             0x1
#define _PSMC3POL_P3POLF_MASK                               0x20
#define _PSMC3POL_P3INPOL_POSN                              0x6
#define _PSMC3POL_P3INPOL_POSITION                          0x6
#define _PSMC3POL_P3INPOL_SIZE                              0x1
#define _PSMC3POL_P3INPOL_LENGTH                            0x1
#define _PSMC3POL_P3INPOL_MASK                              0x40

// Register: PSMC3BLNK
#define PSMC3BLNK PSMC3BLNK
extern volatile unsigned char           PSMC3BLNK           __at(0xED7);
#ifndef _LIB_BUILD
asm("PSMC3BLNK equ 0ED7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3REBM                 :2;
        unsigned                        :2;
        unsigned P3FEBM                 :2;
    };
    struct {
        unsigned P3REBM0                :1;
        unsigned P3REBM1                :1;
        unsigned                        :2;
        unsigned P3FEBM0                :1;
        unsigned P3FEBM1                :1;
    };
} PSMC3BLNKbits_t;
extern volatile PSMC3BLNKbits_t PSMC3BLNKbits __at(0xED7);
// bitfield macros
#define _PSMC3BLNK_P3REBM_POSN                              0x0
#define _PSMC3BLNK_P3REBM_POSITION                          0x0
#define _PSMC3BLNK_P3REBM_SIZE                              0x2
#define _PSMC3BLNK_P3REBM_LENGTH                            0x2
#define _PSMC3BLNK_P3REBM_MASK                              0x3
#define _PSMC3BLNK_P3FEBM_POSN                              0x4
#define _PSMC3BLNK_P3FEBM_POSITION                          0x4
#define _PSMC3BLNK_P3FEBM_SIZE                              0x2
#define _PSMC3BLNK_P3FEBM_LENGTH                            0x2
#define _PSMC3BLNK_P3FEBM_MASK                              0x30
#define _PSMC3BLNK_P3REBM0_POSN                             0x0
#define _PSMC3BLNK_P3REBM0_POSITION                         0x0
#define _PSMC3BLNK_P3REBM0_SIZE                             0x1
#define _PSMC3BLNK_P3REBM0_LENGTH                           0x1
#define _PSMC3BLNK_P3REBM0_MASK                             0x1
#define _PSMC3BLNK_P3REBM1_POSN                             0x1
#define _PSMC3BLNK_P3REBM1_POSITION                         0x1
#define _PSMC3BLNK_P3REBM1_SIZE                             0x1
#define _PSMC3BLNK_P3REBM1_LENGTH                           0x1
#define _PSMC3BLNK_P3REBM1_MASK                             0x2
#define _PSMC3BLNK_P3FEBM0_POSN                             0x4
#define _PSMC3BLNK_P3FEBM0_POSITION                         0x4
#define _PSMC3BLNK_P3FEBM0_SIZE                             0x1
#define _PSMC3BLNK_P3FEBM0_LENGTH                           0x1
#define _PSMC3BLNK_P3FEBM0_MASK                             0x10
#define _PSMC3BLNK_P3FEBM1_POSN                             0x5
#define _PSMC3BLNK_P3FEBM1_POSITION                         0x5
#define _PSMC3BLNK_P3FEBM1_SIZE                             0x1
#define _PSMC3BLNK_P3FEBM1_LENGTH                           0x1
#define _PSMC3BLNK_P3FEBM1_MASK                             0x20

// Register: PSMC3REBS
#define PSMC3REBS PSMC3REBS
extern volatile unsigned char           PSMC3REBS           __at(0xED8);
#ifndef _LIB_BUILD
asm("PSMC3REBS equ 0ED8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P3REBSC1               :1;
        unsigned P3REBSC2               :1;
        unsigned P3REBSC3               :1;
        unsigned P3REBSC4               :1;
        unsigned                        :2;
        unsigned P3REBSIN               :1;
    };
} PSMC3REBSbits_t;
extern volatile PSMC3REBSbits_t PSMC3REBSbits __at(0xED8);
// bitfield macros
#define _PSMC3REBS_P3REBSC1_POSN                            0x1
#define _PSMC3REBS_P3REBSC1_POSITION                        0x1
#define _PSMC3REBS_P3REBSC1_SIZE                            0x1
#define _PSMC3REBS_P3REBSC1_LENGTH                          0x1
#define _PSMC3REBS_P3REBSC1_MASK                            0x2
#define _PSMC3REBS_P3REBSC2_POSN                            0x2
#define _PSMC3REBS_P3REBSC2_POSITION                        0x2
#define _PSMC3REBS_P3REBSC2_SIZE                            0x1
#define _PSMC3REBS_P3REBSC2_LENGTH                          0x1
#define _PSMC3REBS_P3REBSC2_MASK                            0x4
#define _PSMC3REBS_P3REBSC3_POSN                            0x3
#define _PSMC3REBS_P3REBSC3_POSITION                        0x3
#define _PSMC3REBS_P3REBSC3_SIZE                            0x1
#define _PSMC3REBS_P3REBSC3_LENGTH                          0x1
#define _PSMC3REBS_P3REBSC3_MASK                            0x8
#define _PSMC3REBS_P3REBSC4_POSN                            0x4
#define _PSMC3REBS_P3REBSC4_POSITION                        0x4
#define _PSMC3REBS_P3REBSC4_SIZE                            0x1
#define _PSMC3REBS_P3REBSC4_LENGTH                          0x1
#define _PSMC3REBS_P3REBSC4_MASK                            0x10
#define _PSMC3REBS_P3REBSIN_POSN                            0x7
#define _PSMC3REBS_P3REBSIN_POSITION                        0x7
#define _PSMC3REBS_P3REBSIN_SIZE                            0x1
#define _PSMC3REBS_P3REBSIN_LENGTH                          0x1
#define _PSMC3REBS_P3REBSIN_MASK                            0x80

// Register: PSMC3FEBS
#define PSMC3FEBS PSMC3FEBS
extern volatile unsigned char           PSMC3FEBS           __at(0xED9);
#ifndef _LIB_BUILD
asm("PSMC3FEBS equ 0ED9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P3FEBSC1               :1;
        unsigned P3FEBSC2               :1;
        unsigned P3FEBSC3               :1;
        unsigned P3FEBSC4               :1;
        unsigned                        :2;
        unsigned P3FEBSIN               :1;
    };
} PSMC3FEBSbits_t;
extern volatile PSMC3FEBSbits_t PSMC3FEBSbits __at(0xED9);
// bitfield macros
#define _PSMC3FEBS_P3FEBSC1_POSN                            0x1
#define _PSMC3FEBS_P3FEBSC1_POSITION                        0x1
#define _PSMC3FEBS_P3FEBSC1_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSC1_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSC1_MASK                            0x2
#define _PSMC3FEBS_P3FEBSC2_POSN                            0x2
#define _PSMC3FEBS_P3FEBSC2_POSITION                        0x2
#define _PSMC3FEBS_P3FEBSC2_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSC2_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSC2_MASK                            0x4
#define _PSMC3FEBS_P3FEBSC3_POSN                            0x3
#define _PSMC3FEBS_P3FEBSC3_POSITION                        0x3
#define _PSMC3FEBS_P3FEBSC3_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSC3_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSC3_MASK                            0x8
#define _PSMC3FEBS_P3FEBSC4_POSN                            0x4
#define _PSMC3FEBS_P3FEBSC4_POSITION                        0x4
#define _PSMC3FEBS_P3FEBSC4_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSC4_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSC4_MASK                            0x10
#define _PSMC3FEBS_P3FEBSIN_POSN                            0x7
#define _PSMC3FEBS_P3FEBSIN_POSITION                        0x7
#define _PSMC3FEBS_P3FEBSIN_SIZE                            0x1
#define _PSMC3FEBS_P3FEBSIN_LENGTH                          0x1
#define _PSMC3FEBS_P3FEBSIN_MASK                            0x80

// Register: PSMC3PHS
#define PSMC3PHS PSMC3PHS
extern volatile unsigned char           PSMC3PHS            __at(0xEDA);
#ifndef _LIB_BUILD
asm("PSMC3PHS equ 0EDAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3PHST                 :1;
        unsigned P3PHSC1                :1;
        unsigned P3PHSC2                :1;
        unsigned P3PHSC3                :1;
        unsigned P3PHSC4                :1;
        unsigned                        :2;
        unsigned P3PHSIN                :1;
    };
} PSMC3PHSbits_t;
extern volatile PSMC3PHSbits_t PSMC3PHSbits __at(0xEDA);
// bitfield macros
#define _PSMC3PHS_P3PHST_POSN                               0x0
#define _PSMC3PHS_P3PHST_POSITION                           0x0
#define _PSMC3PHS_P3PHST_SIZE                               0x1
#define _PSMC3PHS_P3PHST_LENGTH                             0x1
#define _PSMC3PHS_P3PHST_MASK                               0x1
#define _PSMC3PHS_P3PHSC1_POSN                              0x1
#define _PSMC3PHS_P3PHSC1_POSITION                          0x1
#define _PSMC3PHS_P3PHSC1_SIZE                              0x1
#define _PSMC3PHS_P3PHSC1_LENGTH                            0x1
#define _PSMC3PHS_P3PHSC1_MASK                              0x2
#define _PSMC3PHS_P3PHSC2_POSN                              0x2
#define _PSMC3PHS_P3PHSC2_POSITION                          0x2
#define _PSMC3PHS_P3PHSC2_SIZE                              0x1
#define _PSMC3PHS_P3PHSC2_LENGTH                            0x1
#define _PSMC3PHS_P3PHSC2_MASK                              0x4
#define _PSMC3PHS_P3PHSC3_POSN                              0x3
#define _PSMC3PHS_P3PHSC3_POSITION                          0x3
#define _PSMC3PHS_P3PHSC3_SIZE                              0x1
#define _PSMC3PHS_P3PHSC3_LENGTH                            0x1
#define _PSMC3PHS_P3PHSC3_MASK                              0x8
#define _PSMC3PHS_P3PHSC4_POSN                              0x4
#define _PSMC3PHS_P3PHSC4_POSITION                          0x4
#define _PSMC3PHS_P3PHSC4_SIZE                              0x1
#define _PSMC3PHS_P3PHSC4_LENGTH                            0x1
#define _PSMC3PHS_P3PHSC4_MASK                              0x10
#define _PSMC3PHS_P3PHSIN_POSN                              0x7
#define _PSMC3PHS_P3PHSIN_POSITION                          0x7
#define _PSMC3PHS_P3PHSIN_SIZE                              0x1
#define _PSMC3PHS_P3PHSIN_LENGTH                            0x1
#define _PSMC3PHS_P3PHSIN_MASK                              0x80

