MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
// Register: PSMC3DCS
#define PSMC3DCS PSMC3DCS
extern volatile unsigned char           PSMC3DCS            __at(0xEDB);
#ifndef _LIB_BUILD
asm("PSMC3DCS equ 0EDBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3DCST                 :1;
        unsigned P3DCSC1                :1;
        unsigned P3DCSC2                :1;
        unsigned P3DCSC3                :1;
        unsigned P3DCSC4                :1;
        unsigned                        :2;
        unsigned P3DCSIN                :1;
    };
} PSMC3DCSbits_t;
extern volatile PSMC3DCSbits_t PSMC3DCSbits __at(0xEDB);
// bitfield macros
#define _PSMC3DCS_P3DCST_POSN                               0x0
#define _PSMC3DCS_P3DCST_POSITION                           0x0
#define _PSMC3DCS_P3DCST_SIZE                               0x1
#define _PSMC3DCS_P3DCST_LENGTH                             0x1
#define _PSMC3DCS_P3DCST_MASK                               0x1
#define _PSMC3DCS_P3DCSC1_POSN                              0x1
#define _PSMC3DCS_P3DCSC1_POSITION                          0x1
#define _PSMC3DCS_P3DCSC1_SIZE                              0x1
#define _PSMC3DCS_P3DCSC1_LENGTH                            0x1
#define _PSMC3DCS_P3DCSC1_MASK                              0x2
#define _PSMC3DCS_P3DCSC2_POSN                              0x2
#define _PSMC3DCS_P3DCSC2_POSITION                          0x2
#define _PSMC3DCS_P3DCSC2_SIZE                              0x1
#define _PSMC3DCS_P3DCSC2_LENGTH                            0x1
#define _PSMC3DCS_P3DCSC2_MASK                              0x4
#define _PSMC3DCS_P3DCSC3_POSN                              0x3
#define _PSMC3DCS_P3DCSC3_POSITION                          0x3
#define _PSMC3DCS_P3DCSC3_SIZE                              0x1
#define _PSMC3DCS_P3DCSC3_LENGTH                            0x1
#define _PSMC3DCS_P3DCSC3_MASK                              0x8
#define _PSMC3DCS_P3DCSC4_POSN                              0x4
#define _PSMC3DCS_P3DCSC4_POSITION                          0x4
#define _PSMC3DCS_P3DCSC4_SIZE                              0x1
#define _PSMC3DCS_P3DCSC4_LENGTH                            0x1
#define _PSMC3DCS_P3DCSC4_MASK                              0x10
#define _PSMC3DCS_P3DCSIN_POSN                              0x7
#define _PSMC3DCS_P3DCSIN_POSITION                          0x7
#define _PSMC3DCS_P3DCSIN_SIZE                              0x1
#define _PSMC3DCS_P3DCSIN_LENGTH                            0x1
#define _PSMC3DCS_P3DCSIN_MASK                              0x80

// Register: PSMC3PRS
#define PSMC3PRS PSMC3PRS
extern volatile unsigned char           PSMC3PRS            __at(0xEDC);
#ifndef _LIB_BUILD
asm("PSMC3PRS equ 0EDCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3PRST                 :1;
        unsigned P3PRSC1                :1;
        unsigned P3PRSC2                :1;
        unsigned P3PRSC3                :1;
        unsigned P3PRSC4                :1;
        unsigned                        :2;
        unsigned P3PRSIN                :1;
    };
} PSMC3PRSbits_t;
extern volatile PSMC3PRSbits_t PSMC3PRSbits __at(0xEDC);
// bitfield macros
#define _PSMC3PRS_P3PRST_POSN                               0x0
#define _PSMC3PRS_P3PRST_POSITION                           0x0
#define _PSMC3PRS_P3PRST_SIZE                               0x1
#define _PSMC3PRS_P3PRST_LENGTH                             0x1
#define _PSMC3PRS_P3PRST_MASK                               0x1
#define _PSMC3PRS_P3PRSC1_POSN                              0x1
#define _PSMC3PRS_P3PRSC1_POSITION                          0x1
#define _PSMC3PRS_P3PRSC1_SIZE                              0x1
#define _PSMC3PRS_P3PRSC1_LENGTH                            0x1
#define _PSMC3PRS_P3PRSC1_MASK                              0x2
#define _PSMC3PRS_P3PRSC2_POSN                              0x2
#define _PSMC3PRS_P3PRSC2_POSITION                          0x2
#define _PSMC3PRS_P3PRSC2_SIZE                              0x1
#define _PSMC3PRS_P3PRSC2_LENGTH                            0x1
#define _PSMC3PRS_P3PRSC2_MASK                              0x4
#define _PSMC3PRS_P3PRSC3_POSN                              0x3
#define _PSMC3PRS_P3PRSC3_POSITION                          0x3
#define _PSMC3PRS_P3PRSC3_SIZE                              0x1
#define _PSMC3PRS_P3PRSC3_LENGTH                            0x1
#define _PSMC3PRS_P3PRSC3_MASK                              0x8
#define _PSMC3PRS_P3PRSC4_POSN                              0x4
#define _PSMC3PRS_P3PRSC4_POSITION                          0x4
#define _PSMC3PRS_P3PRSC4_SIZE                              0x1
#define _PSMC3PRS_P3PRSC4_LENGTH                            0x1
#define _PSMC3PRS_P3PRSC4_MASK                              0x10
#define _PSMC3PRS_P3PRSIN_POSN                              0x7
#define _PSMC3PRS_P3PRSIN_POSITION                          0x7
#define _PSMC3PRS_P3PRSIN_SIZE                              0x1
#define _PSMC3PRS_P3PRSIN_LENGTH                            0x1
#define _PSMC3PRS_P3PRSIN_MASK                              0x80

// Register: PSMC3ASDC
#define PSMC3ASDC PSMC3ASDC
extern volatile unsigned char           PSMC3ASDC           __at(0xEDD);
#ifndef _LIB_BUILD
asm("PSMC3ASDC equ 0EDDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3ASDOV                :1;
        unsigned                        :4;
        unsigned P3ARSEN                :1;
        unsigned P3ASDEN                :1;
        unsigned P3ASE                  :1;
    };
} PSMC3ASDCbits_t;
extern volatile PSMC3ASDCbits_t PSMC3ASDCbits __at(0xEDD);
// bitfield macros
#define _PSMC3ASDC_P3ASDOV_POSN                             0x0
#define _PSMC3ASDC_P3ASDOV_POSITION                         0x0
#define _PSMC3ASDC_P3ASDOV_SIZE                             0x1
#define _PSMC3ASDC_P3ASDOV_LENGTH                           0x1
#define _PSMC3ASDC_P3ASDOV_MASK                             0x1
#define _PSMC3ASDC_P3ARSEN_POSN                             0x5
#define _PSMC3ASDC_P3ARSEN_POSITION                         0x5
#define _PSMC3ASDC_P3ARSEN_SIZE                             0x1
#define _PSMC3ASDC_P3ARSEN_LENGTH                           0x1
#define _PSMC3ASDC_P3ARSEN_MASK                             0x20
#define _PSMC3ASDC_P3ASDEN_POSN                             0x6
#define _PSMC3ASDC_P3ASDEN_POSITION                         0x6
#define _PSMC3ASDC_P3ASDEN_SIZE                             0x1
#define _PSMC3ASDC_P3ASDEN_LENGTH                           0x1
#define _PSMC3ASDC_P3ASDEN_MASK                             0x40
#define _PSMC3ASDC_P3ASE_POSN                               0x7
#define _PSMC3ASDC_P3ASE_POSITION                           0x7
#define _PSMC3ASDC_P3ASE_SIZE                               0x1
#define _PSMC3ASDC_P3ASE_LENGTH                             0x1
#define _PSMC3ASDC_P3ASE_MASK                               0x80

// Register: PSMC3ASDL
#define PSMC3ASDL PSMC3ASDL
extern volatile unsigned char           PSMC3ASDL           __at(0xEDE);
#ifndef _LIB_BUILD
asm("PSMC3ASDL equ 0EDEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3ASDLA                :1;
        unsigned P3ASDLB                :1;
        unsigned P3ASDLC                :1;
        unsigned P3ASDLD                :1;
        unsigned P3ASDLE                :1;
        unsigned P3ASDLF                :1;
    };
} PSMC3ASDLbits_t;
extern volatile PSMC3ASDLbits_t PSMC3ASDLbits __at(0xEDE);
// bitfield macros
#define _PSMC3ASDL_P3ASDLA_POSN                             0x0
#define _PSMC3ASDL_P3ASDLA_POSITION                         0x0
#define _PSMC3ASDL_P3ASDLA_SIZE                             0x1
#define _PSMC3ASDL_P3ASDLA_LENGTH                           0x1
#define _PSMC3ASDL_P3ASDLA_MASK                             0x1
#define _PSMC3ASDL_P3ASDLB_POSN                             0x1
#define _PSMC3ASDL_P3ASDLB_POSITION                         0x1
#define _PSMC3ASDL_P3ASDLB_SIZE                             0x1
#define _PSMC3ASDL_P3ASDLB_LENGTH                           0x1
#define _PSMC3ASDL_P3ASDLB_MASK                             0x2
#define _PSMC3ASDL_P3ASDLC_POSN                             0x2
#define _PSMC3ASDL_P3ASDLC_POSITION                         0x2
#define _PSMC3ASDL_P3ASDLC_SIZE                             0x1
#define _PSMC3ASDL_P3ASDLC_LENGTH                           0x1
#define _PSMC3ASDL_P3ASDLC_MASK                             0x4
#define _PSMC3ASDL_P3ASDLD_POSN                             0x3
#define _PSMC3ASDL_P3ASDLD_POSITION                         0x3
#define _PSMC3ASDL_P3ASDLD_SIZE                             0x1
#define _PSMC3ASDL_P3ASDLD_LENGTH                           0x1
#define _PSMC3ASDL_P3ASDLD_MASK                             0x8
#define _PSMC3ASDL_P3ASDLE_POSN                             0x4
#define _PSMC3ASDL_P3ASDLE_POSITION                         0x4
#define _PSMC3ASDL_P3ASDLE_SIZE                             0x1
#define _PSMC3ASDL_P3ASDLE_LENGTH                           0x1
#define _PSMC3ASDL_P3ASDLE_MASK                             0x10
#define _PSMC3ASDL_P3ASDLF_POSN                             0x5
#define _PSMC3ASDL_P3ASDLF_POSITION                         0x5
#define _PSMC3ASDL_P3ASDLF_SIZE                             0x1
#define _PSMC3ASDL_P3ASDLF_LENGTH                           0x1
#define _PSMC3ASDL_P3ASDLF_MASK                             0x20

// Register: PSMC3ASDS
#define PSMC3ASDS PSMC3ASDS
extern volatile unsigned char           PSMC3ASDS           __at(0xEDF);
#ifndef _LIB_BUILD
asm("PSMC3ASDS equ 0EDFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P3ASDSC1               :1;
        unsigned P3ASDSC2               :1;
        unsigned P3ASDSC3               :1;
        unsigned P3ASDSC4               :1;
        unsigned                        :2;
        unsigned P3ASDSIN               :1;
    };
} PSMC3ASDSbits_t;
