MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
// Register: PSMC4PRL
#define PSMC4PRL PSMC4PRL
extern volatile unsigned char           PSMC4PRL            __at(0xF25);
#ifndef _LIB_BUILD
asm("PSMC4PRL equ 0F25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4PR0               :1;
        unsigned PSMC4PR1               :1;
        unsigned PSMC4PR2               :1;
        unsigned PSMC4PR3               :1;
        unsigned PSMC4PR4               :1;
        unsigned PSMC4PR5               :1;
        unsigned PSMC4PR6               :1;
        unsigned PSMC4PR7               :1;
    };
} PSMC4PRLbits_t;
extern volatile PSMC4PRLbits_t PSMC4PRLbits __at(0xF25);
// bitfield macros
#define _PSMC4PRL_PSMC4PR0_POSN                             0x0
#define _PSMC4PRL_PSMC4PR0_POSITION                         0x0
#define _PSMC4PRL_PSMC4PR0_SIZE                             0x1
#define _PSMC4PRL_PSMC4PR0_LENGTH                           0x1
#define _PSMC4PRL_PSMC4PR0_MASK                             0x1
#define _PSMC4PRL_PSMC4PR1_POSN                             0x1
#define _PSMC4PRL_PSMC4PR1_POSITION                         0x1
#define _PSMC4PRL_PSMC4PR1_SIZE                             0x1
#define _PSMC4PRL_PSMC4PR1_LENGTH                           0x1
#define _PSMC4PRL_PSMC4PR1_MASK                             0x2
#define _PSMC4PRL_PSMC4PR2_POSN                             0x2
#define _PSMC4PRL_PSMC4PR2_POSITION                         0x2
#define _PSMC4PRL_PSMC4PR2_SIZE                             0x1
#define _PSMC4PRL_PSMC4PR2_LENGTH                           0x1
#define _PSMC4PRL_PSMC4PR2_MASK                             0x4
#define _PSMC4PRL_PSMC4PR3_POSN                             0x3
#define _PSMC4PRL_PSMC4PR3_POSITION                         0x3
#define _PSMC4PRL_PSMC4PR3_SIZE                             0x1
#define _PSMC4PRL_PSMC4PR3_LENGTH                           0x1
#define _PSMC4PRL_PSMC4PR3_MASK                             0x8
#define _PSMC4PRL_PSMC4PR4_POSN                             0x4
#define _PSMC4PRL_PSMC4PR4_POSITION                         0x4
#define _PSMC4PRL_PSMC4PR4_SIZE                             0x1
#define _PSMC4PRL_PSMC4PR4_LENGTH                           0x1
#define _PSMC4PRL_PSMC4PR4_MASK                             0x10
#define _PSMC4PRL_PSMC4PR5_POSN                             0x5
#define _PSMC4PRL_PSMC4PR5_POSITION                         0x5
#define _PSMC4PRL_PSMC4PR5_SIZE                             0x1
#define _PSMC4PRL_PSMC4PR5_LENGTH                           0x1
#define _PSMC4PRL_PSMC4PR5_MASK                             0x20
#define _PSMC4PRL_PSMC4PR6_POSN                             0x6
#define _PSMC4PRL_PSMC4PR6_POSITION                         0x6
#define _PSMC4PRL_PSMC4PR6_SIZE                             0x1
#define _PSMC4PRL_PSMC4PR6_LENGTH                           0x1
#define _PSMC4PRL_PSMC4PR6_MASK                             0x40
#define _PSMC4PRL_PSMC4PR7_POSN                             0x7
#define _PSMC4PRL_PSMC4PR7_POSITION                         0x7
#define _PSMC4PRL_PSMC4PR7_SIZE                             0x1
#define _PSMC4PRL_PSMC4PR7_LENGTH                           0x1
#define _PSMC4PRL_PSMC4PR7_MASK                             0x80

// Register: PSMC4PRH
#define PSMC4PRH PSMC4PRH
extern volatile unsigned char           PSMC4PRH            __at(0xF26);
#ifndef _LIB_BUILD
asm("PSMC4PRH equ 0F26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4PR8               :1;
        unsigned PSMC4PR9               :1;
        unsigned PSMC4PR10              :1;
        unsigned PSMC4PR11              :1;
        unsigned PSMC4PR12              :1;
        unsigned PSMC4PR13              :1;
        unsigned PSMC4PR14              :1;
        unsigned PSMC4PR15              :1;
    };
} PSMC4PRHbits_t;
extern volatile PSMC4PRHbits_t PSMC4PRHbits __at(0xF26);
// bitfield macros
#define _PSMC4PRH_PSMC4PR8_POSN                             0x0
#define _PSMC4PRH_PSMC4PR8_POSITION                         0x0
#define _PSMC4PRH_PSMC4PR8_SIZE                             0x1
#define _PSMC4PRH_PSMC4PR8_LENGTH                           0x1
#define _PSMC4PRH_PSMC4PR8_MASK                             0x1
#define _PSMC4PRH_PSMC4PR9_POSN                             0x1
#define _PSMC4PRH_PSMC4PR9_POSITION                         0x1
#define _PSMC4PRH_PSMC4PR9_SIZE                             0x1
#define _PSMC4PRH_PSMC4PR9_LENGTH                           0x1
#define _PSMC4PRH_PSMC4PR9_MASK                             0x2
#define _PSMC4PRH_PSMC4PR10_POSN                            0x2
#define _PSMC4PRH_PSMC4PR10_POSITION                        0x2
#define _PSMC4PRH_PSMC4PR10_SIZE                            0x1
#define _PSMC4PRH_PSMC4PR10_LENGTH                          0x1
#define _PSMC4PRH_PSMC4PR10_MASK                            0x4
#define _PSMC4PRH_PSMC4PR11_POSN                            0x3
#define _PSMC4PRH_PSMC4PR11_POSITION                        0x3
#define _PSMC4PRH_PSMC4PR11_SIZE                            0x1
#define _PSMC4PRH_PSMC4PR11_LENGTH                          0x1
#define _PSMC4PRH_PSMC4PR11_MASK                            0x8
#define _PSMC4PRH_PSMC4PR12_POSN                            0x4
#define _PSMC4PRH_PSMC4PR12_POSITION                        0x4
#define _PSMC4PRH_PSMC4PR12_SIZE                            0x1
#define _PSMC4PRH_PSMC4PR12_LENGTH                          0x1
#define _PSMC4PRH_PSMC4PR12_MASK                            0x10
#define _PSMC4PRH_PSMC4PR13_POSN                            0x5
#define _PSMC4PRH_PSMC4PR13_POSITION                        0x5
#define _PSMC4PRH_PSMC4PR13_SIZE                            0x1
#define _PSMC4PRH_PSMC4PR13_LENGTH                          0x1
#define _PSMC4PRH_PSMC4PR13_MASK                            0x20
#define _PSMC4PRH_PSMC4PR14_POSN                            0x6
#define _PSMC4PRH_PSMC4PR14_POSITION                        0x6
#define _PSMC4PRH_PSMC4PR14_SIZE                            0x1
#define _PSMC4PRH_PSMC4PR14_LENGTH                          0x1
#define _PSMC4PRH_PSMC4PR14_MASK                            0x40
#define _PSMC4PRH_PSMC4PR15_POSN                            0x7
#define _PSMC4PRH_PSMC4PR15_POSITION                        0x7
#define _PSMC4PRH_PSMC4PR15_SIZE                            0x1
#define _PSMC4PRH_PSMC4PR15_LENGTH                          0x1
#define _PSMC4PRH_PSMC4PR15_MASK                            0x80

// Register: PSMC4TMR
#define PSMC4TMR PSMC4TMR
extern volatile unsigned short          PSMC4TMR            __at(0xF27);
#ifndef _LIB_BUILD
asm("PSMC4TMR equ 0F27h");
#endif

// Register: PSMC4TMRL
#define PSMC4TMRL PSMC4TMRL
extern volatile unsigned char           PSMC4TMRL           __at(0xF27);
#ifndef _LIB_BUILD
asm("PSMC4TMRL equ 0F27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4TMR0              :1;
        unsigned PSMC4TMR1              :1;
        unsigned PSMC4TMR2              :1;
        unsigned PSMC4TMR3              :1;
        unsigned PSMC4TMR4              :1;
        unsigned PSMC4TMR5              :1;
        unsigned PSMC4TMR6              :1;
        unsigned PSMC4TMR7              :1;
    };
} PSMC4TMRLbits_t;
extern volatile PSMC4TMRLbits_t PSMC4TMRLbits __at(0xF27);
// bitfield macros
#define _PSMC4TMRL_PSMC4TMR0_POSN                           0x0
#define _PSMC4TMRL_PSMC4TMR0_POSITION                       0x0
#define _PSMC4TMRL_PSMC4TMR0_SIZE                           0x1
#define _PSMC4TMRL_PSMC4TMR0_LENGTH                         0x1
#define _PSMC4TMRL_PSMC4TMR0_MASK                           0x1
#define _PSMC4TMRL_PSMC4TMR1_POSN                           0x1
#define _PSMC4TMRL_PSMC4TMR1_POSITION                       0x1
#define _PSMC4TMRL_PSMC4TMR1_SIZE                           0x1
#define _PSMC4TMRL_PSMC4TMR1_LENGTH                         0x1
#define _PSMC4TMRL_PSMC4TMR1_MASK                           0x2
#define _PSMC4TMRL_PSMC4TMR2_POSN                           0x2
#define _PSMC4TMRL_PSMC4TMR2_POSITION                       0x2
#define _PSMC4TMRL_PSMC4TMR2_SIZE                           0x1
#define _PSMC4TMRL_PSMC4TMR2_LENGTH                         0x1
#define _PSMC4TMRL_PSMC4TMR2_MASK                           0x4
#define _PSMC4TMRL_PSMC4TMR3_POSN                           0x3
#define _PSMC4TMRL_PSMC4TMR3_POSITION                       0x3
#define _PSMC4TMRL_PSMC4TMR3_SIZE                           0x1
#define _PSMC4TMRL_PSMC4TMR3_LENGTH                         0x1
#define _PSMC4TMRL_PSMC4TMR3_MASK                           0x8
#define _PSMC4TMRL_PSMC4TMR4_POSN                           0x4
#define _PSMC4TMRL_PSMC4TMR4_POSITION                       0x4
#define _PSMC4TMRL_PSMC4TMR4_SIZE                           0x1
#define _PSMC4TMRL_PSMC4TMR4_LENGTH                         0x1
#define _PSMC4TMRL_PSMC4TMR4_MASK                           0x10
#define _PSMC4TMRL_PSMC4TMR5_POSN                           0x5
#define _PSMC4TMRL_PSMC4TMR5_POSITION                       0x5
#define _PSMC4TMRL_PSMC4TMR5_SIZE                           0x1
#define _PSMC4TMRL_PSMC4TMR5_LENGTH                         0x1
#define _PSMC4TMRL_PSMC4TMR5_MASK                           0x20
#define _PSMC4TMRL_PSMC4TMR6_POSN                           0x6
#define _PSMC4TMRL_PSMC4TMR6_POSITION                       0x6
#define _PSMC4TMRL_PSMC4TMR6_SIZE                           0x1
#define _PSMC4TMRL_PSMC4TMR6_LENGTH                         0x1
#define _PSMC4TMRL_PSMC4TMR6_MASK                           0x40
#define _PSMC4TMRL_PSMC4TMR7_POSN                           0x7
#define _PSMC4TMRL_PSMC4TMR7_POSITION                       0x7
#define _PSMC4TMRL_PSMC4TMR7_SIZE                           0x1
#define _PSMC4TMRL_PSMC4TMR7_LENGTH                         0x1
#define _PSMC4TMRL_PSMC4TMR7_MASK                           0x80

// Register: PSMC4TMRH
#define PSMC4TMRH PSMC4TMRH
extern volatile unsigned char           PSMC4TMRH           __at(0xF28);
#ifndef _LIB_BUILD
asm("PSMC4TMRH equ 0F28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4TMR8              :1;
        unsigned PSMC4TMR9              :1;
        unsigned PSMC4TMR10             :1;
        unsigned PSMC4TMR11             :1;
        unsigned PSMC4TMR12             :1;
        unsigned PSMC4TMR13             :1;
        unsigned PSMC4TMR14             :1;
        unsigned PSMC4TMR15             :1;
    };
} PSMC4TMRHbits_t;
extern volatile PSMC4TMRHbits_t PSMC4TMRHbits __at(0xF28);
// bitfield macros
#define _PSMC4TMRH_PSMC4TMR8_POSN                           0x0
#define _PSMC4TMRH_PSMC4TMR8_POSITION                       0x0
#define _PSMC4TMRH_PSMC4TMR8_SIZE                           0x1
#define _PSMC4TMRH_PSMC4TMR8_LENGTH                         0x1
#define _PSMC4TMRH_PSMC4TMR8_MASK                           0x1
#define _PSMC4TMRH_PSMC4TMR9_POSN                           0x1
#define _PSMC4TMRH_PSMC4TMR9_POSITION                       0x1
#define _PSMC4TMRH_PSMC4TMR9_SIZE                           0x1
#define _PSMC4TMRH_PSMC4TMR9_LENGTH                         0x1
#define _PSMC4TMRH_PSMC4TMR9_MASK                           0x2
#define _PSMC4TMRH_PSMC4TMR10_POSN                          0x2
#define _PSMC4TMRH_PSMC4TMR10_POSITION                      0x2
#define _PSMC4TMRH_PSMC4TMR10_SIZE                          0x1
#define _PSMC4TMRH_PSMC4TMR10_LENGTH                        0x1
#define _PSMC4TMRH_PSMC4TMR10_MASK                          0x4
#define _PSMC4TMRH_PSMC4TMR11_POSN                          0x3
#define _PSMC4TMRH_PSMC4TMR11_POSITION                      0x3
#define _PSMC4TMRH_PSMC4TMR11_SIZE                          0x1
#define _PSMC4TMRH_PSMC4TMR11_LENGTH                        0x1
#define _PSMC4TMRH_PSMC4TMR11_MASK                          0x8
#define _PSMC4TMRH_PSMC4TMR12_POSN                          0x4
#define _PSMC4TMRH_PSMC4TMR12_POSITION                      0x4
#define _PSMC4TMRH_PSMC4TMR12_SIZE                          0x1
#define _PSMC4TMRH_PSMC4TMR12_LENGTH                        0x1
#define _PSMC4TMRH_PSMC4TMR12_MASK                          0x10
#define _PSMC4TMRH_PSMC4TMR13_POSN                          0x5
#define _PSMC4TMRH_PSMC4TMR13_POSITION                      0x5
#define _PSMC4TMRH_PSMC4TMR13_SIZE                          0x1
#define _PSMC4TMRH_PSMC4TMR13_LENGTH                        0x1
#define _PSMC4TMRH_PSMC4TMR13_MASK                          0x20
#define _PSMC4TMRH_PSMC4TMR14_POSN                          0x6
#define _PSMC4TMRH_PSMC4TMR14_POSITION                      0x6
#define _PSMC4TMRH_PSMC4TMR14_SIZE                          0x1
#define _PSMC4TMRH_PSMC4TMR14_LENGTH                        0x1
#define _PSMC4TMRH_PSMC4TMR14_MASK                          0x40
#define _PSMC4TMRH_PSMC4TMR15_POSN                          0x7
#define _PSMC4TMRH_PSMC4TMR15_POSITION                      0x7
#define _PSMC4TMRH_PSMC4TMR15_SIZE                          0x1
#define _PSMC4TMRH_PSMC4TMR15_LENGTH                        0x1
#define _PSMC4TMRH_PSMC4TMR15_MASK                          0x80

// Register: PSMC4DBR
#define PSMC4DBR PSMC4DBR
extern volatile unsigned char           PSMC4DBR            __at(0xF29);
#ifndef _LIB_BUILD
asm("PSMC4DBR equ 0F29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4DBR0              :1;
        unsigned PSMC4DBR1              :1;
        unsigned PSMC4DBR2              :1;
        unsigned PSMC4DBR3              :1;
        unsigned PSMC4DBR4              :1;
        unsigned PSMC4DBR5              :1;
        unsigned PSMC4DBR6              :1;
        unsigned PSMC4DBR7              :1;
    };
} PSMC4DBRbits_t;
extern volatile PSMC4DBRbits_t PSMC4DBRbits __at(0xF29);
// bitfield macros
#define _PSMC4DBR_PSMC4DBR0_POSN                            0x0
#define _PSMC4DBR_PSMC4DBR0_POSITION                        0x0
#define _PSMC4DBR_PSMC4DBR0_SIZE                            0x1
#define _PSMC4DBR_PSMC4DBR0_LENGTH                          0x1
#define _PSMC4DBR_PSMC4DBR0_MASK                            0x1
#define _PSMC4DBR_PSMC4DBR1_POSN                            0x1
#define _PSMC4DBR_PSMC4DBR1_POSITION                        0x1
#define _PSMC4DBR_PSMC4DBR1_SIZE                            0x1
#define _PSMC4DBR_PSMC4DBR1_LENGTH                          0x1
#define _PSMC4DBR_PSMC4DBR1_MASK                            0x2
#define _PSMC4DBR_PSMC4DBR2_POSN                            0x2
#define _PSMC4DBR_PSMC4DBR2_POSITION                        0x2
#define _PSMC4DBR_PSMC4DBR2_SIZE                            0x1
#define _PSMC4DBR_PSMC4DBR2_LENGTH                          0x1
#define _PSMC4DBR_PSMC4DBR2_MASK                            0x4
#define _PSMC4DBR_PSMC4DBR3_POSN                            0x3
#define _PSMC4DBR_PSMC4DBR3_POSITION                        0x3
#define _PSMC4DBR_PSMC4DBR3_SIZE                            0x1
#define _PSMC4DBR_PSMC4DBR3_LENGTH                          0x1
#define _PSMC4DBR_PSMC4DBR3_MASK                            0x8
#define _PSMC4DBR_PSMC4DBR4_POSN                            0x4
#define _PSMC4DBR_PSMC4DBR4_POSITION                        0x4
#define _PSMC4DBR_PSMC4DBR4_SIZE                            0x1
#define _PSMC4DBR_PSMC4DBR4_LENGTH                          0x1
#define _PSMC4DBR_PSMC4DBR4_MASK                            0x10
#define _PSMC4DBR_PSMC4DBR5_POSN                            0x5
#define _PSMC4DBR_PSMC4DBR5_POSITION                        0x5
#define _PSMC4DBR_PSMC4DBR5_SIZE                            0x1
#define _PSMC4DBR_PSMC4DBR5_LENGTH                          0x1
#define _PSMC4DBR_PSMC4DBR5_MASK                            0x20
#define _PSMC4DBR_PSMC4DBR6_POSN                            0x6
#define _PSMC4DBR_PSMC4DBR6_POSITION                        0x6
#define _PSMC4DBR_PSMC4DBR6_SIZE                            0x1
#define _PSMC4DBR_PSMC4DBR6_LENGTH                          0x1
#define _PSMC4DBR_PSMC4DBR6_MASK                            0x40
#define _PSMC4DBR_PSMC4DBR7_POSN                            0x7
#define _PSMC4DBR_PSMC4DBR7_POSITION                        0x7
#define _PSMC4DBR_PSMC4DBR7_SIZE                            0x1
#define _PSMC4DBR_PSMC4DBR7_LENGTH                          0x1
#define _PSMC4DBR_PSMC4DBR7_MASK                            0x80

// Register: PSMC4DBF
#define PSMC4DBF PSMC4DBF
extern volatile unsigned char           PSMC4DBF            __at(0xF2A);
#ifndef _LIB_BUILD
asm("PSMC4DBF equ 0F2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4DBF0              :1;
        unsigned PSMC4DBF1              :1;
        unsigned PSMC4DBF2              :1;
        unsigned PSMC4DBF3              :1;
        unsigned PSMC4DBF4              :1;
        unsigned PSMC4DBF5              :1;
        unsigned PSMC4DBF6              :1;
        unsigned PSMC4DBF7              :1;
    };
} PSMC4DBFbits_t;
extern volatile PSMC4DBFbits_t PSMC4DBFbits __at(0xF2A);
// bitfield macros
#define _PSMC4DBF_PSMC4DBF0_POSN                            0x0
#define _PSMC4DBF_PSMC4DBF0_POSITION                        0x0
#define _PSMC4DBF_PSMC4DBF0_SIZE                            0x1
#define _PSMC4DBF_PSMC4DBF0_LENGTH                          0x1
#define _PSMC4DBF_PSMC4DBF0_MASK                            0x1
#define _PSMC4DBF_PSMC4DBF1_POSN                            0x1
#define _PSMC4DBF_PSMC4DBF1_POSITION                        0x1
#define _PSMC4DBF_PSMC4DBF1_SIZE                            0x1
#define _PSMC4DBF_PSMC4DBF1_LENGTH                          0x1
#define _PSMC4DBF_PSMC4DBF1_MASK                            0x2
#define _PSMC4DBF_PSMC4DBF2_POSN                            0x2
#define _PSMC4DBF_PSMC4DBF2_POSITION                        0x2
#define _PSMC4DBF_PSMC4DBF2_SIZE                            0x1
#define _PSMC4DBF_PSMC4DBF2_LENGTH                          0x1
#define _PSMC4DBF_PSMC4DBF2_MASK                            0x4
#define _PSMC4DBF_PSMC4DBF3_POSN                            0x3
#define _PSMC4DBF_PSMC4DBF3_POSITION                        0x3
#define _PSMC4DBF_PSMC4DBF3_SIZE                            0x1
#define _PSMC4DBF_PSMC4DBF3_LENGTH                          0x1
#define _PSMC4DBF_PSMC4DBF3_MASK                            0x8
#define _PSMC4DBF_PSMC4DBF4_POSN                            0x4
#define _PSMC4DBF_PSMC4DBF4_POSITION                        0x4
#define _PSMC4DBF_PSMC4DBF4_SIZE                            0x1
#define _PSMC4DBF_PSMC4DBF4_LENGTH                          0x1
#define _PSMC4DBF_PSMC4DBF4_MASK                            0x10
#define _PSMC4DBF_PSMC4DBF5_POSN                            0x5
#define _PSMC4DBF_PSMC4DBF5_POSITION                        0x5
#define _PSMC4DBF_PSMC4DBF5_SIZE                            0x1
#define _PSMC4DBF_PSMC4DBF5_LENGTH                          0x1
#define _PSMC4DBF_PSMC4DBF5_MASK                            0x20
#define _PSMC4DBF_PSMC4DBF6_POSN                            0x6
#define _PSMC4DBF_PSMC4DBF6_POSITION                        0x6
#define _PSMC4DBF_PSMC4DBF6_SIZE                            0x1
#define _PSMC4DBF_PSMC4DBF6_LENGTH                          0x1
#define _PSMC4DBF_PSMC4DBF6_MASK                            0x40
#define _PSMC4DBF_PSMC4DBF7_POSN                            0x7
#define _PSMC4DBF_PSMC4DBF7_POSITION                        0x7
#define _PSMC4DBF_PSMC4DBF7_SIZE                            0x1
#define _PSMC4DBF_PSMC4DBF7_LENGTH                          0x1
#define _PSMC4DBF_PSMC4DBF7_MASK                            0x80

// Register: PSMC4BLKR
#define PSMC4BLKR PSMC4BLKR
extern volatile unsigned char           PSMC4BLKR           __at(0xF2B);
#ifndef _LIB_BUILD
asm("PSMC4BLKR equ 0F2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC4BLKR0             :1;
        unsigned PSMC4BLKR1             :1;
        unsigned PSMC4BLKR2             :1;
        unsigned PSMC4BLKR3             :1;
        unsigned PSMC4BLKR4             :1;
        unsigned PSMC4BLKR5             :1;
        unsigned PSMC4BLKR6             :1;
        unsigned PSMC4BLKR7             :1;
    };
} PSMC4BLKRbits_t;
extern volatile PSMC4BLKRbits_t PSMC4BLKRbits __at(0xF2B);
// bitfield macros
#define _PSMC4BLKR_PSMC4BLKR0_POSN                          0x0
#define _PSMC4BLKR_PSMC4BLKR0_POSITION                      0x0
#define _PSMC4BLKR_PSMC4BLKR0_SIZE                          0x1
#define _PSMC4BLKR_PSMC4BLKR0_LENGTH                        0x1
#define _PSMC4BLKR_PSMC4BLKR0_MASK                          0x1
#define _PSMC4BLKR_PSMC4BLKR1_POSN                          0x1
#define _PSMC4BLKR_PSMC4BLKR1_POSITION                      0x1
#define _PSMC4BLKR_PSMC4BLKR1_SIZE                          0x1
#define _PSMC4BLKR_PSMC4BLKR1_LENGTH                        0x1
#define _PSMC4BLKR_PSMC4BLKR1_MASK                          0x2
#define _PSMC4BLKR_PSMC4BLKR2_POSN                          0x2
#define _PSMC4BLKR_PSMC4BLKR2_POSITION                      0x2
#define _PSMC4BLKR_PSMC4BLKR2_SIZE                          0x1
#define _PSMC4BLKR_PSMC4BLKR2_LENGTH                        0x1
#define _PSMC4BLKR_PSMC4BLKR2_MASK                          0x4
#define _PSMC4BLKR_PSMC4BLKR3_POSN                          0x3
#define _PSMC4BLKR_PSMC4BLKR3_POSITION                      0x3
#define _PSMC4BLKR_PSMC4BLKR3_SIZE                          0x1
#define _PSMC4BLKR_PSMC4BLKR3_LENGTH                        0x1
#define _PSMC4BLKR_PSMC4BLKR3_MASK                          0x8
#define _PSMC4BLKR_PSMC4BLKR4_POSN                          0x4
#define _PSMC4BLKR_PSMC4BLKR4_POSITION                      0x4
#define _PSMC4BLKR_PSMC4BLKR4_SIZE                          0x1
#define _PSMC4BLKR_PSMC4BLKR4_LENGTH                        0x1
#define _PSMC4BLKR_PSMC4BLKR4_MASK                          0x10
#define _PSMC4BLKR_PSMC4BLKR5_POSN                          0x5
#define _PSMC4BLKR_PSMC4BLKR5_POSITION                      0x5
#define _PSMC4BLKR_PSMC4BLKR5_SIZE                          0x1
#define _PSMC4BLKR_PSMC4BLKR5_LENGTH                        0x1
#define _PSMC4BLKR_PSMC4BLKR5_MASK                          0x20
#define _PSMC4BLKR_PSMC4BLKR6_POSN                          0x6
#define _PSMC4BLKR_PSMC4BLKR6_POSITION                      0x6
#define _PSMC4BLKR_PSMC4BLKR6_SIZE                          0x1
#define _PSMC4BLKR_PSMC4BLKR6_LENGTH                        0x1
#define _PSMC4BLKR_PSMC4BLKR6_MASK                          0x40
#define _PSMC4BLKR_PSMC4BLKR7_POSN                          0x7
#define _PSMC4BLKR_PSMC4BLKR7_POSITION                      0x7
#define _PSMC4BLKR_PSMC4BLKR7_SIZE                          0x1
#define _PSMC4BLKR_PSMC4BLKR7_LENGTH                        0x1
#define _PSMC4BLKR_PSMC4BLKR7_MASK                          0x80

