MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x1CBD);	// @ (0x397 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x1CBE);	// @ (0x397 * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCCP<IOCCP7>
extern volatile __bit                   IOCCP7              __at(0x1CBF);	// @ (0x397 * 8 + 7)
#define                                 IOCCP7_bit          _BIT_ACCESS(IOCCP,7)
// IOCEF<IOCEF3>
extern volatile __bit                   IOCEF3              __at(0x1CFB);	// @ (0x39F * 8 + 3)
#define                                 IOCEF3_bit          _BIT_ACCESS(IOCEF,3)
// IOCEN<IOCEN3>
extern volatile __bit                   IOCEN3              __at(0x1CF3);	// @ (0x39E * 8 + 3)
#define                                 IOCEN3_bit          _BIT_ACCESS(IOCEN,3)
// IOCEP<IOCEP3>
extern volatile __bit                   IOCEP3              __at(0x1CEB);	// @ (0x39D * 8 + 3)
#define                                 IOCEP3_bit          _BIT_ACCESS(IOCEP,3)
// INTCON<IOCIE>
extern volatile __bit                   IOCIE               __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 IOCIE_bit           _BIT_ACCESS(INTCON,3)
// INTCON<IOCIF>
extern volatile __bit                   IOCIF               __at(0x58);	// @ (0xB * 8 + 0)
#define                                 IOCIF_bit           _BIT_ACCESS(INTCON,0)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,3)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x4CC);	// @ (0x99 * 8 + 4)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x4CD);	// @ (0x99 * 8 + 5)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF3>
extern volatile __bit                   IRCF3               __at(0x4CE);	// @ (0x99 * 8 + 6)
#define                                 IRCF3_bit           _BIT_ACCESS(OSCCON,6)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x860);	// @ (0x10C * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x861);	// @ (0x10C * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x862);	// @ (0x10C * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0x863);	// @ (0x10C * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x864);	// @ (0x10C * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x865);	// @ (0x10C * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x866);	// @ (0x10C * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x867);	// @ (0x10C * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x868);	// @ (0x10D * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x869);	// @ (0x10D * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x86A);	// @ (0x10D * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x86B);	// @ (0x10D * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x86C);	// @ (0x10D * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x86D);	// @ (0x10D * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x86E);	// @ (0x10D * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x86F);	// @ (0x10D * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x870);	// @ (0x10E * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x871);	// @ (0x10E * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x872);	// @ (0x10E * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x873);	// @ (0x10E * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x874);	// @ (0x10E * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x875);	// @ (0x10E * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x876);	// @ (0x10E * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x877);	// @ (0x10E * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATD<LATD0>
extern volatile __bit                   LATD0               __at(0x878);	// @ (0x10F * 8 + 0)
#define                                 LATD0_bit           _BIT_ACCESS(LATD,0)
// LATD<LATD1>
extern volatile __bit                   LATD1               __at(0x879);	// @ (0x10F * 8 + 1)
#define                                 LATD1_bit           _BIT_ACCESS(LATD,1)
// LATD<LATD2>
extern volatile __bit                   LATD2               __at(0x87A);	// @ (0x10F * 8 + 2)
#define                                 LATD2_bit           _BIT_ACCESS(LATD,2)
// LATD<LATD3>
extern volatile __bit                   LATD3               __at(0x87B);	// @ (0x10F * 8 + 3)
#define                                 LATD3_bit           _BIT_ACCESS(LATD,3)
// LATD<LATD4>
extern volatile __bit                   LATD4               __at(0x87C);	// @ (0x10F * 8 + 4)
#define                                 LATD4_bit           _BIT_ACCESS(LATD,4)
// LATD<LATD5>
extern volatile __bit                   LATD5               __at(0x87D);	// @ (0x10F * 8 + 5)
#define                                 LATD5_bit           _BIT_ACCESS(LATD,5)
// LATD<LATD6>
extern volatile __bit                   LATD6               __at(0x87E);	// @ (0x10F * 8 + 6)
#define                                 LATD6_bit           _BIT_ACCESS(LATD,6)
// LATD<LATD7>
extern volatile __bit                   LATD7               __at(0x87F);	// @ (0x10F * 8 + 7)
#define                                 LATD7_bit           _BIT_ACCESS(LATD,7)
// LATE<LATE0>
extern volatile __bit                   LATE0               __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 LATE0_bit           _BIT_ACCESS(LATE,0)
// LATE<LATE1>
extern volatile __bit                   LATE1               __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 LATE1_bit           _BIT_ACCESS(LATE,1)
// LATE<LATE2>
extern volatile __bit                   LATE2               __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 LATE2_bit           _BIT_ACCESS(LATE,2)
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
#define                                 LFIOFR_bit          _BIT_ACCESS(OSCSTAT,1)
// EECON1<LWLO>
extern volatile __bit                   LWLO                __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(EECON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// CMOUT<MC3OUT>
extern volatile __bit                   MC3OUT              __at(0x8AA);	// @ (0x115 * 8 + 2)
#define                                 MC3OUT_bit          _BIT_ACCESS(CMOUT,2)
// CMOUT<MC4OUT>
extern volatile __bit                   MC4OUT              __at(0x8AB);	// @ (0x115 * 8 + 3)
#define                                 MC4OUT_bit          _BIT_ACCESS(CMOUT,3)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4D2);	// @ (0x9A * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// SSP1MSK<MSK0>
extern volatile __bit                   MSK0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<MSK1>
extern volatile __bit                   MSK1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<MSK2>
extern volatile __bit                   MSK2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<MSK3>
extern volatile __bit                   MSK3                __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// ODCONA<ODCONA0>
extern volatile __bit                   ODCONA0             __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODCONA0_bit         _BIT_ACCESS(ODCONA,0)
// ODCONA<ODCONA1>
extern volatile __bit                   ODCONA1             __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODCONA1_bit         _BIT_ACCESS(ODCONA,1)
// ODCONA<ODCONA2>
extern volatile __bit                   ODCONA2             __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODCONA2_bit         _BIT_ACCESS(ODCONA,2)
// ODCONA<ODCONA3>
extern volatile __bit                   ODCONA3             __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 ODCONA3_bit         _BIT_ACCESS(ODCONA,3)
// ODCONA<ODCONA4>
extern volatile __bit                   ODCONA4             __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODCONA4_bit         _BIT_ACCESS(ODCONA,4)
// ODCONA<ODCONA5>
extern volatile __bit                   ODCONA5             __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODCONA5_bit         _BIT_ACCESS(ODCONA,5)
// ODCONA<ODCONA6>
extern volatile __bit                   ODCONA6             __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 ODCONA6_bit         _BIT_ACCESS(ODCONA,6)
// ODCONA<ODCONA7>
extern volatile __bit                   ODCONA7             __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 ODCONA7_bit         _BIT_ACCESS(ODCONA,7)
// ODCONB<ODCONB0>
extern volatile __bit                   ODCONB0             __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 ODCONB0_bit         _BIT_ACCESS(ODCONB,0)
// ODCONB<ODCONB1>
extern volatile __bit                   ODCONB1             __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 ODCONB1_bit         _BIT_ACCESS(ODCONB,1)
// ODCONB<ODCONB2>
extern volatile __bit                   ODCONB2             __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 ODCONB2_bit         _BIT_ACCESS(ODCONB,2)
// ODCONB<ODCONB3>
extern volatile __bit                   ODCONB3             __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 ODCONB3_bit         _BIT_ACCESS(ODCONB,3)
// ODCONB<ODCONB4>
extern volatile __bit                   ODCONB4             __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODCONB4_bit         _BIT_ACCESS(ODCONB,4)
// ODCONB<ODCONB5>
extern volatile __bit                   ODCONB5             __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODCONB5_bit         _BIT_ACCESS(ODCONB,5)
// ODCONB<ODCONB6>
extern volatile __bit                   ODCONB6             __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODCONB6_bit         _BIT_ACCESS(ODCONB,6)
// ODCONB<ODCONB7>
extern volatile __bit                   ODCONB7             __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODCONB7_bit         _BIT_ACCESS(ODCONB,7)
// ODCONC<ODCONC0>
extern volatile __bit                   ODCONC0             __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODCONC0_bit         _BIT_ACCESS(ODCONC,0)
// ODCONC<ODCONC1>
extern volatile __bit                   ODCONC1             __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODCONC1_bit         _BIT_ACCESS(ODCONC,1)
// ODCONC<ODCONC2>
extern volatile __bit                   ODCONC2             __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODCONC2_bit         _BIT_ACCESS(ODCONC,2)
// ODCONC<ODCONC3>
extern volatile __bit                   ODCONC3             __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODCONC3_bit         _BIT_ACCESS(ODCONC,3)
// ODCONC<ODCONC4>
extern volatile __bit                   ODCONC4             __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODCONC4_bit         _BIT_ACCESS(ODCONC,4)
// ODCONC<ODCONC5>
extern volatile __bit                   ODCONC5             __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODCONC5_bit         _BIT_ACCESS(ODCONC,5)
// ODCONC<ODCONC6>
extern volatile __bit                   ODCONC6             __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODCONC6_bit         _BIT_ACCESS(ODCONC,6)
// ODCONC<ODCONC7>
extern volatile __bit                   ODCONC7             __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODCONC7_bit         _BIT_ACCESS(ODCONC,7)
// ODCOND<ODCOND0>
extern volatile __bit                   ODCOND0             __at(0x1478);	// @ (0x28F * 8 + 0)
#define                                 ODCOND0_bit         _BIT_ACCESS(ODCOND,0)
// ODCOND<ODCOND1>
extern volatile __bit                   ODCOND1             __at(0x1479);	// @ (0x28F * 8 + 1)
#define                                 ODCOND1_bit         _BIT_ACCESS(ODCOND,1)
// ODCOND<ODCOND2>
extern volatile __bit                   ODCOND2             __at(0x147A);	// @ (0x28F * 8 + 2)
#define                                 ODCOND2_bit         _BIT_ACCESS(ODCOND,2)
// ODCOND<ODCOND3>
extern volatile __bit                   ODCOND3             __at(0x147B);	// @ (0x28F * 8 + 3)
#define                                 ODCOND3_bit         _BIT_ACCESS(ODCOND,3)
// ODCOND<ODCOND4>
extern volatile __bit                   ODCOND4             __at(0x147C);	// @ (0x28F * 8 + 4)
#define                                 ODCOND4_bit         _BIT_ACCESS(ODCOND,4)
// ODCOND<ODCOND5>
extern volatile __bit                   ODCOND5             __at(0x147D);	// @ (0x28F * 8 + 5)
#define                                 ODCOND5_bit         _BIT_ACCESS(ODCOND,5)
// ODCOND<ODCOND6>
extern volatile __bit                   ODCOND6             __at(0x147E);	// @ (0x28F * 8 + 6)
#define                                 ODCOND6_bit         _BIT_ACCESS(ODCOND,6)
// ODCOND<ODCOND7>
extern volatile __bit                   ODCOND7             __at(0x147F);	// @ (0x28F * 8 + 7)
#define                                 ODCOND7_bit         _BIT_ACCESS(ODCOND,7)
// ODCONE<ODCONE0>
extern volatile __bit                   ODCONE0             __at(0x1480);	// @ (0x290 * 8 + 0)
#define                                 ODCONE0_bit         _BIT_ACCESS(ODCONE,0)
// ODCONE<ODCONE1>
extern volatile __bit                   ODCONE1             __at(0x1481);	// @ (0x290 * 8 + 1)
#define                                 ODCONE1_bit         _BIT_ACCESS(ODCONE,1)
// ODCONE<ODCONE2>
extern volatile __bit                   ODCONE2             __at(0x1482);	// @ (0x290 * 8 + 2)
#define                                 ODCONE2_bit         _BIT_ACCESS(ODCONE,2)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OPA1CON<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON,7)
// OPA1CON<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1PCH2>
extern volatile __bit                   OPA1PCH2            __at(0x288A);	// @ (0x511 * 8 + 2)
#define                                 OPA1PCH2_bit        _BIT_ACCESS(OPA1CON,2)
// OPA1CON<OPA1SP>
extern volatile __bit                   OPA1SP              __at(0x288E);	// @ (0x511 * 8 + 6)
#define                                 OPA1SP_bit          _BIT_ACCESS(OPA1CON,6)
// OPA2CON<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x289F);	// @ (0x513 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON,7)
// OPA2CON<OPA2PCH0>
extern volatile __bit                   OPA2PCH0            __at(0x2898);	// @ (0x513 * 8 + 0)
#define                                 OPA2PCH0_bit        _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2PCH1>
extern volatile __bit                   OPA2PCH1            __at(0x2899);	// @ (0x513 * 8 + 1)
#define                                 OPA2PCH1_bit        _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2PCH2>
extern volatile __bit                   OPA2PCH2            __at(0x289A);	// @ (0x513 * 8 + 2)
#define                                 OPA2PCH2_bit        _BIT_ACCESS(OPA2CON,2)
// OPA2CON<OPA2SP>
extern volatile __bit                   OPA2SP              __at(0x289E);	// @ (0x513 * 8 + 6)
#define                                 OPA2SP_bit          _BIT_ACCESS(OPA2CON,6)
// OPA3CON<OPA3EN>
extern volatile __bit                   OPA3EN              __at(0x28AF);	// @ (0x515 * 8 + 7)
#define                                 OPA3EN_bit          _BIT_ACCESS(OPA3CON,7)
// OPA3CON<OPA3PCH0>
extern volatile __bit                   OPA3PCH0            __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 OPA3PCH0_bit        _BIT_ACCESS(OPA3CON,0)
// OPA3CON<OPA3PCH1>
extern volatile __bit                   OPA3PCH1            __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 OPA3PCH1_bit        _BIT_ACCESS(OPA3CON,1)
// OPA3CON<OPA3PCH2>
extern volatile __bit                   OPA3PCH2            __at(0x28AA);	// @ (0x515 * 8 + 2)
#define                                 OPA3PCH2_bit        _BIT_ACCESS(OPA3CON,2)
// OPA3CON<OPA3SP>
extern volatile __bit                   OPA3SP              __at(0x28AE);	// @ (0x515 * 8 + 6)
#define                                 OPA3SP_bit          _BIT_ACCESS(OPA3CON,6)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// PSMC1ASDC<P1ARSEN>
extern volatile __bit                   P1ARSEN             __at(0x74ED);	// @ (0xE9D * 8 + 5)
#define                                 P1ARSEN_bit         _BIT_ACCESS(PSMC1ASDC,5)
// PSMC1ASDC<P1ASDEN>
extern volatile __bit                   P1ASDEN             __at(0x74EE);	// @ (0xE9D * 8 + 6)
#define                                 P1ASDEN_bit         _BIT_ACCESS(PSMC1ASDC,6)
// PSMC1ASDL<P1ASDLA>
extern volatile __bit                   P1ASDLA             __at(0x74F0);	// @ (0xE9E * 8 + 0)
#define                                 P1ASDLA_bit         _BIT_ACCESS(PSMC1ASDL,0)
// PSMC1ASDL<P1ASDLB>
extern volatile __bit                   P1ASDLB             __at(0x74F1);	// @ (0xE9E * 8 + 1)
#define                                 P1ASDLB_bit         _BIT_ACCESS(PSMC1ASDL,1)
// PSMC1ASDL<P1ASDLC>
extern volatile __bit                   P1ASDLC             __at(0x74F2);	// @ (0xE9E * 8 + 2)
#define                                 P1ASDLC_bit         _BIT_ACCESS(PSMC1ASDL,2)
// PSMC1ASDL<P1ASDLD>
extern volatile __bit                   P1ASDLD             __at(0x74F3);	// @ (0xE9E * 8 + 3)
#define                                 P1ASDLD_bit         _BIT_ACCESS(PSMC1ASDL,3)
// PSMC1ASDL<P1ASDLE>
extern volatile __bit                   P1ASDLE             __at(0x74F4);	// @ (0xE9E * 8 + 4)
#define                                 P1ASDLE_bit         _BIT_ACCESS(PSMC1ASDL,4)
// PSMC1ASDL<P1ASDLF>
