MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
extern volatile __bit                   P3POLA              __at(0x76B0);	// @ (0xED6 * 8 + 0)
#define                                 P3POLA_bit          _BIT_ACCESS(PSMC3POL,0)
// PSMC3POL<P3POLB>
extern volatile __bit                   P3POLB              __at(0x76B1);	// @ (0xED6 * 8 + 1)
#define                                 P3POLB_bit          _BIT_ACCESS(PSMC3POL,1)
// PSMC3POL<P3POLC>
extern volatile __bit                   P3POLC              __at(0x76B2);	// @ (0xED6 * 8 + 2)
#define                                 P3POLC_bit          _BIT_ACCESS(PSMC3POL,2)
// PSMC3POL<P3POLD>
extern volatile __bit                   P3POLD              __at(0x76B3);	// @ (0xED6 * 8 + 3)
#define                                 P3POLD_bit          _BIT_ACCESS(PSMC3POL,3)
// PSMC3POL<P3POLE>
extern volatile __bit                   P3POLE              __at(0x76B4);	// @ (0xED6 * 8 + 4)
#define                                 P3POLE_bit          _BIT_ACCESS(PSMC3POL,4)
// PSMC3POL<P3POLF>
extern volatile __bit                   P3POLF              __at(0x76B5);	// @ (0xED6 * 8 + 5)
#define                                 P3POLF_bit          _BIT_ACCESS(PSMC3POL,5)
// PSMC3SYNC<P3PRPOL>
extern volatile __bit                   P3PRPOL             __at(0x769E);	// @ (0xED3 * 8 + 6)
#define                                 P3PRPOL_bit         _BIT_ACCESS(PSMC3SYNC,6)
// PSMC3PRS<P3PRSC1>
extern volatile __bit                   P3PRSC1             __at(0x76E1);	// @ (0xEDC * 8 + 1)
#define                                 P3PRSC1_bit         _BIT_ACCESS(PSMC3PRS,1)
// PSMC3PRS<P3PRSC2>
extern volatile __bit                   P3PRSC2             __at(0x76E2);	// @ (0xEDC * 8 + 2)
#define                                 P3PRSC2_bit         _BIT_ACCESS(PSMC3PRS,2)
// PSMC3PRS<P3PRSC3>
extern volatile __bit                   P3PRSC3             __at(0x76E3);	// @ (0xEDC * 8 + 3)
#define                                 P3PRSC3_bit         _BIT_ACCESS(PSMC3PRS,3)
// PSMC3PRS<P3PRSC4>
extern volatile __bit                   P3PRSC4             __at(0x76E4);	// @ (0xEDC * 8 + 4)
#define                                 P3PRSC4_bit         _BIT_ACCESS(PSMC3PRS,4)
// PSMC3PRS<P3PRSIN>
extern volatile __bit                   P3PRSIN             __at(0x76E7);	// @ (0xEDC * 8 + 7)
#define                                 P3PRSIN_bit         _BIT_ACCESS(PSMC3PRS,7)
// PSMC3PRS<P3PRST>
extern volatile __bit                   P3PRST              __at(0x76E0);	// @ (0xEDC * 8 + 0)
#define                                 P3PRST_bit          _BIT_ACCESS(PSMC3PRS,0)
// PSMC3BLNK<P3REBM0>
extern volatile __bit                   P3REBM0             __at(0x76B8);	// @ (0xED7 * 8 + 0)
#define                                 P3REBM0_bit         _BIT_ACCESS(PSMC3BLNK,0)
// PSMC3BLNK<P3REBM1>
extern volatile __bit                   P3REBM1             __at(0x76B9);	// @ (0xED7 * 8 + 1)
#define                                 P3REBM1_bit         _BIT_ACCESS(PSMC3BLNK,1)
// PSMC3REBS<P3REBSC1>
extern volatile __bit                   P3REBSC1            __at(0x76C1);	// @ (0xED8 * 8 + 1)
#define                                 P3REBSC1_bit        _BIT_ACCESS(PSMC3REBS,1)
// PSMC3REBS<P3REBSC2>
extern volatile __bit                   P3REBSC2            __at(0x76C2);	// @ (0xED8 * 8 + 2)
#define                                 P3REBSC2_bit        _BIT_ACCESS(PSMC3REBS,2)
// PSMC3REBS<P3REBSC3>
extern volatile __bit                   P3REBSC3            __at(0x76C3);	// @ (0xED8 * 8 + 3)
#define                                 P3REBSC3_bit        _BIT_ACCESS(PSMC3REBS,3)
// PSMC3REBS<P3REBSC4>
extern volatile __bit                   P3REBSC4            __at(0x76C4);	// @ (0xED8 * 8 + 4)
#define                                 P3REBSC4_bit        _BIT_ACCESS(PSMC3REBS,4)
// PSMC3REBS<P3REBSIN>
extern volatile __bit                   P3REBSIN            __at(0x76C7);	// @ (0xED8 * 8 + 7)
#define                                 P3REBSIN_bit        _BIT_ACCESS(PSMC3REBS,7)
// PSMC3STR1<P3SSYNC>
extern volatile __bit                   P3SSYNC             __at(0x777F);	// @ (0xEEF * 8 + 7)
#define                                 P3SSYNC_bit         _BIT_ACCESS(PSMC3STR1,7)
// PSMC3STR0<P3STRA>
extern volatile __bit                   P3STRA              __at(0x7770);	// @ (0xEEE * 8 + 0)
#define                                 P3STRA_bit          _BIT_ACCESS(PSMC3STR0,0)
// PSMC3STR0<P3STRB>
extern volatile __bit                   P3STRB              __at(0x7771);	// @ (0xEEE * 8 + 1)
#define                                 P3STRB_bit          _BIT_ACCESS(PSMC3STR0,1)
// PSMC3STR0<P3STRC>
extern volatile __bit                   P3STRC              __at(0x7772);	// @ (0xEEE * 8 + 2)
#define                                 P3STRC_bit          _BIT_ACCESS(PSMC3STR0,2)
// PSMC3STR0<P3STRD>
extern volatile __bit                   P3STRD              __at(0x7773);	// @ (0xEEE * 8 + 3)
#define                                 P3STRD_bit          _BIT_ACCESS(PSMC3STR0,3)
// PSMC3STR0<P3STRE>
extern volatile __bit                   P3STRE              __at(0x7774);	// @ (0xEEE * 8 + 4)
#define                                 P3STRE_bit          _BIT_ACCESS(PSMC3STR0,4)
// PSMC3STR0<P3STRF>
extern volatile __bit                   P3STRF              __at(0x7775);	// @ (0xEEE * 8 + 5)
#define                                 P3STRF_bit          _BIT_ACCESS(PSMC3STR0,5)
// PSMC3SYNC<P3SYNC0>
extern volatile __bit                   P3SYNC0             __at(0x7698);	// @ (0xED3 * 8 + 0)
#define                                 P3SYNC0_bit         _BIT_ACCESS(PSMC3SYNC,0)
// PSMC3SYNC<P3SYNC1>
extern volatile __bit                   P3SYNC1             __at(0x7699);	// @ (0xED3 * 8 + 1)
#define                                 P3SYNC1_bit         _BIT_ACCESS(PSMC3SYNC,1)
// PSMC3SYNC<P3SYNC2>
extern volatile __bit                   P3SYNC2             __at(0x769A);	// @ (0xED3 * 8 + 2)
#define                                 P3SYNC2_bit         _BIT_ACCESS(PSMC3SYNC,2)
// PSMC3INT<P3TDCIE>
extern volatile __bit                   P3TDCIE             __at(0x7705);	// @ (0xEE0 * 8 + 5)
#define                                 P3TDCIE_bit         _BIT_ACCESS(PSMC3INT,5)
// PSMC3INT<P3TDCIF>
extern volatile __bit                   P3TDCIF             __at(0x7701);	// @ (0xEE0 * 8 + 1)
#define                                 P3TDCIF_bit         _BIT_ACCESS(PSMC3INT,1)
// PSMC3INT<P3TOVIE>
extern volatile __bit                   P3TOVIE             __at(0x7707);	// @ (0xEE0 * 8 + 7)
#define                                 P3TOVIE_bit         _BIT_ACCESS(PSMC3INT,7)
// PSMC3INT<P3TOVIF>
extern volatile __bit                   P3TOVIF             __at(0x7703);	// @ (0xEE0 * 8 + 3)
#define                                 P3TOVIF_bit         _BIT_ACCESS(PSMC3INT,3)
// PSMC3INT<P3TPHIE>
extern volatile __bit                   P3TPHIE             __at(0x7706);	// @ (0xEE0 * 8 + 6)
#define                                 P3TPHIE_bit         _BIT_ACCESS(PSMC3INT,6)
// PSMC3INT<P3TPHIF>
extern volatile __bit                   P3TPHIF             __at(0x7702);	// @ (0xEE0 * 8 + 2)
#define                                 P3TPHIF_bit         _BIT_ACCESS(PSMC3INT,2)
// PSMC3INT<P3TPRIE>
extern volatile __bit                   P3TPRIE             __at(0x7704);	// @ (0xEE0 * 8 + 4)
#define                                 P3TPRIE_bit         _BIT_ACCESS(PSMC3INT,4)
// PSMC3INT<P3TPRIF>
extern volatile __bit                   P3TPRIF             __at(0x7700);	// @ (0xEE0 * 8 + 0)
#define                                 P3TPRIF_bit         _BIT_ACCESS(PSMC3INT,0)
// PSMC4ASDC<P4ARSEN>
extern volatile __bit                   P4ARSEN             __at(0x78ED);	// @ (0xF1D * 8 + 5)
#define                                 P4ARSEN_bit         _BIT_ACCESS(PSMC4ASDC,5)
// PSMC4ASDC<P4ASDEN>
extern volatile __bit                   P4ASDEN             __at(0x78EE);	// @ (0xF1D * 8 + 6)
#define                                 P4ASDEN_bit         _BIT_ACCESS(PSMC4ASDC,6)
// PSMC4ASDL<P4ASDLA>
extern volatile __bit                   P4ASDLA             __at(0x78F0);	// @ (0xF1E * 8 + 0)
#define                                 P4ASDLA_bit         _BIT_ACCESS(PSMC4ASDL,0)
// PSMC4ASDL<P4ASDLB>
extern volatile __bit                   P4ASDLB             __at(0x78F1);	// @ (0xF1E * 8 + 1)
#define                                 P4ASDLB_bit         _BIT_ACCESS(PSMC4ASDL,1)
// PSMC4ASDC<P4ASDOV>
extern volatile __bit                   P4ASDOV             __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 P4ASDOV_bit         _BIT_ACCESS(PSMC4ASDC,0)
// PSMC4ASDS<P4ASDSC1>
extern volatile __bit                   P4ASDSC1            __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 P4ASDSC1_bit        _BIT_ACCESS(PSMC4ASDS,1)
// PSMC4ASDS<P4ASDSC2>
extern volatile __bit                   P4ASDSC2            __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 P4ASDSC2_bit        _BIT_ACCESS(PSMC4ASDS,2)
// PSMC4ASDS<P4ASDSC3>
extern volatile __bit                   P4ASDSC3            __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 P4ASDSC3_bit        _BIT_ACCESS(PSMC4ASDS,3)
// PSMC4ASDS<P4ASDSC4>
extern volatile __bit                   P4ASDSC4            __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 P4ASDSC4_bit        _BIT_ACCESS(PSMC4ASDS,4)
// PSMC4ASDS<P4ASDSIN>
extern volatile __bit                   P4ASDSIN            __at(0x78FF);	// @ (0xF1F * 8 + 7)
#define                                 P4ASDSIN_bit        _BIT_ACCESS(PSMC4ASDS,7)
// PSMC4ASDC<P4ASE>
extern volatile __bit                   P4ASE               __at(0x78EF);	// @ (0xF1D * 8 + 7)
#define                                 P4ASE_bit           _BIT_ACCESS(PSMC4ASDC,7)
// PSMC4CLK<P4CPRE0>
extern volatile __bit                   P4CPRE0             __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 P4CPRE0_bit         _BIT_ACCESS(PSMC4CLK,4)
// PSMC4CLK<P4CPRE1>
extern volatile __bit                   P4CPRE1             __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 P4CPRE1_bit         _BIT_ACCESS(PSMC4CLK,5)
// PSMC4CLK<P4CSRC0>
extern volatile __bit                   P4CSRC0             __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 P4CSRC0_bit         _BIT_ACCESS(PSMC4CLK,0)
// PSMC4CLK<P4CSRC1>
extern volatile __bit                   P4CSRC1             __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 P4CSRC1_bit         _BIT_ACCESS(PSMC4CLK,1)
// PSMC4CON<P4DBFE>
extern volatile __bit                   P4DBFE              __at(0x788D);	// @ (0xF11 * 8 + 5)
#define                                 P4DBFE_bit          _BIT_ACCESS(PSMC4CON,5)
// PSMC4CON<P4DBRE>
extern volatile __bit                   P4DBRE              __at(0x788C);	// @ (0xF11 * 8 + 4)
#define                                 P4DBRE_bit          _BIT_ACCESS(PSMC4CON,4)
// PSMC4SYNC<P4DCPOL>
extern volatile __bit                   P4DCPOL             __at(0x789D);	// @ (0xF13 * 8 + 5)
#define                                 P4DCPOL_bit         _BIT_ACCESS(PSMC4SYNC,5)
// PSMC4DCS<P4DCSC1>
extern volatile __bit                   P4DCSC1             __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 P4DCSC1_bit         _BIT_ACCESS(PSMC4DCS,1)
// PSMC4DCS<P4DCSC2>
extern volatile __bit                   P4DCSC2             __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 P4DCSC2_bit         _BIT_ACCESS(PSMC4DCS,2)
// PSMC4DCS<P4DCSC3>
extern volatile __bit                   P4DCSC3             __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 P4DCSC3_bit         _BIT_ACCESS(PSMC4DCS,3)
// PSMC4DCS<P4DCSC4>
extern volatile __bit                   P4DCSC4             __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 P4DCSC4_bit         _BIT_ACCESS(PSMC4DCS,4)
// PSMC4DCS<P4DCSIN>
extern volatile __bit                   P4DCSIN             __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 P4DCSIN_bit         _BIT_ACCESS(PSMC4DCS,7)
// PSMC4DCS<P4DCST>
extern volatile __bit                   P4DCST              __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 P4DCST_bit          _BIT_ACCESS(PSMC4DCS,0)
// PSMC4BLNK<P4FEBM0>
extern volatile __bit                   P4FEBM0             __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 P4FEBM0_bit         _BIT_ACCESS(PSMC4BLNK,4)
// PSMC4BLNK<P4FEBM1>
extern volatile __bit                   P4FEBM1             __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 P4FEBM1_bit         _BIT_ACCESS(PSMC4BLNK,5)
// PSMC4FEBS<P4FEBSC1>
extern volatile __bit                   P4FEBSC1            __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 P4FEBSC1_bit        _BIT_ACCESS(PSMC4FEBS,1)
// PSMC4FEBS<P4FEBSC2>
extern volatile __bit                   P4FEBSC2            __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 P4FEBSC2_bit        _BIT_ACCESS(PSMC4FEBS,2)
// PSMC4FEBS<P4FEBSC3>
extern volatile __bit                   P4FEBSC3            __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 P4FEBSC3_bit        _BIT_ACCESS(PSMC4FEBS,3)
// PSMC4FEBS<P4FEBSC4>
extern volatile __bit                   P4FEBSC4            __at(0x78CC);	// @ (0xF19 * 8 + 4)
#define                                 P4FEBSC4_bit        _BIT_ACCESS(PSMC4FEBS,4)
// PSMC4FEBS<P4FEBSIN>
extern volatile __bit                   P4FEBSIN            __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 P4FEBSIN_bit        _BIT_ACCESS(PSMC4FEBS,7)
// PSMC4STR1<P4HSMEN>
extern volatile __bit                   P4HSMEN             __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 P4HSMEN_bit         _BIT_ACCESS(PSMC4STR1,0)
// PSMC4POL<P4INPOL>
extern volatile __bit                   P4INPOL             __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 P4INPOL_bit         _BIT_ACCESS(PSMC4POL,6)
// PSMC4STR1<P4LSMEN>
extern volatile __bit                   P4LSMEN             __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 P4LSMEN_bit         _BIT_ACCESS(PSMC4STR1,1)
// PSMC4MDL<P4MDLBIT>
extern volatile __bit                   P4MDLBIT            __at(0x7895);	// @ (0xF12 * 8 + 5)
#define                                 P4MDLBIT_bit        _BIT_ACCESS(PSMC4MDL,5)
// PSMC4MDL<P4MDLEN>
extern volatile __bit                   P4MDLEN             __at(0x7897);	// @ (0xF12 * 8 + 7)
#define                                 P4MDLEN_bit         _BIT_ACCESS(PSMC4MDL,7)
// PSMC4MDL<P4MDLPOL>
extern volatile __bit                   P4MDLPOL            __at(0x7896);	// @ (0xF12 * 8 + 6)
#define                                 P4MDLPOL_bit        _BIT_ACCESS(PSMC4MDL,6)
// PSMC4CON<P4MODE0>
extern volatile __bit                   P4MODE0             __at(0x7888);	// @ (0xF11 * 8 + 0)
#define                                 P4MODE0_bit         _BIT_ACCESS(PSMC4CON,0)
// PSMC4CON<P4MODE1>
extern volatile __bit                   P4MODE1             __at(0x7889);	// @ (0xF11 * 8 + 1)
#define                                 P4MODE1_bit         _BIT_ACCESS(PSMC4CON,1)
// PSMC4CON<P4MODE2>
extern volatile __bit                   P4MODE2             __at(0x788A);	// @ (0xF11 * 8 + 2)
#define                                 P4MODE2_bit         _BIT_ACCESS(PSMC4CON,2)
// PSMC4CON<P4MODE3>
extern volatile __bit                   P4MODE3             __at(0x788B);	// @ (0xF11 * 8 + 3)
#define                                 P4MODE3_bit         _BIT_ACCESS(PSMC4CON,3)
// PSMC4MDL<P4MSRC0>
extern volatile __bit                   P4MSRC0             __at(0x7890);	// @ (0xF12 * 8 + 0)
#define                                 P4MSRC0_bit         _BIT_ACCESS(PSMC4MDL,0)
// PSMC4MDL<P4MSRC1>
extern volatile __bit                   P4MSRC1             __at(0x7891);	// @ (0xF12 * 8 + 1)
#define                                 P4MSRC1_bit         _BIT_ACCESS(PSMC4MDL,1)
// PSMC4MDL<P4MSRC2>
extern volatile __bit                   P4MSRC2             __at(0x7892);	// @ (0xF12 * 8 + 2)
#define                                 P4MSRC2_bit         _BIT_ACCESS(PSMC4MDL,2)
// PSMC4MDL<P4MSRC3>
extern volatile __bit                   P4MSRC3             __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 P4MSRC3_bit         _BIT_ACCESS(PSMC4MDL,3)
// PSMC4OEN<P4OEA>
extern volatile __bit                   P4OEA               __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 P4OEA_bit           _BIT_ACCESS(PSMC4OEN,0)
// PSMC4OEN<P4OEB>
extern volatile __bit                   P4OEB               __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 P4OEB_bit           _BIT_ACCESS(PSMC4OEN,1)
// PSMC4PHS<P4PHSC1>
extern volatile __bit                   P4PHSC1             __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 P4PHSC1_bit         _BIT_ACCESS(PSMC4PHS,1)
// PSMC4PHS<P4PHSC2>
extern volatile __bit                   P4PHSC2             __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 P4PHSC2_bit         _BIT_ACCESS(PSMC4PHS,2)
// PSMC4PHS<P4PHSC3>
extern volatile __bit                   P4PHSC3             __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 P4PHSC3_bit         _BIT_ACCESS(PSMC4PHS,3)
// PSMC4PHS<P4PHSC4>
extern volatile __bit                   P4PHSC4             __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 P4PHSC4_bit         _BIT_ACCESS(PSMC4PHS,4)
// PSMC4PHS<P4PHSIN>
extern volatile __bit                   P4PHSIN             __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 P4PHSIN_bit         _BIT_ACCESS(PSMC4PHS,7)
// PSMC4PHS<P4PHST>
extern volatile __bit                   P4PHST              __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 P4PHST_bit          _BIT_ACCESS(PSMC4PHS,0)
// PSMC4SYNC<P4POFST>
extern volatile __bit                   P4POFST             __at(0x789F);	// @ (0xF13 * 8 + 7)
#define                                 P4POFST_bit         _BIT_ACCESS(PSMC4SYNC,7)
// PSMC4POL<P4POLA>
extern volatile __bit                   P4POLA              __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 P4POLA_bit          _BIT_ACCESS(PSMC4POL,0)
// PSMC4POL<P4POLB>
extern volatile __bit                   P4POLB              __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 P4POLB_bit          _BIT_ACCESS(PSMC4POL,1)
// PSMC4SYNC<P4PRPOL>
extern volatile __bit                   P4PRPOL             __at(0x789E);	// @ (0xF13 * 8 + 6)
#define                                 P4PRPOL_bit         _BIT_ACCESS(PSMC4SYNC,6)
// PSMC4PRS<P4PRSC1>
extern volatile __bit                   P4PRSC1             __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 P4PRSC1_bit         _BIT_ACCESS(PSMC4PRS,1)
// PSMC4PRS<P4PRSC2>
extern volatile __bit                   P4PRSC2             __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 P4PRSC2_bit         _BIT_ACCESS(PSMC4PRS,2)
// PSMC4PRS<P4PRSC3>
extern volatile __bit                   P4PRSC3             __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 P4PRSC3_bit         _BIT_ACCESS(PSMC4PRS,3)
// PSMC4PRS<P4PRSC4>
extern volatile __bit                   P4PRSC4             __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 P4PRSC4_bit         _BIT_ACCESS(PSMC4PRS,4)
// PSMC4PRS<P4PRSIN>
extern volatile __bit                   P4PRSIN             __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 P4PRSIN_bit         _BIT_ACCESS(PSMC4PRS,7)
// PSMC4PRS<P4PRST>
extern volatile __bit                   P4PRST              __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 P4PRST_bit          _BIT_ACCESS(PSMC4PRS,0)
// PSMC4BLNK<P4REBM0>
extern volatile __bit                   P4REBM0             __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 P4REBM0_bit         _BIT_ACCESS(PSMC4BLNK,0)
// PSMC4BLNK<P4REBM1>
extern volatile __bit                   P4REBM1             __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 P4REBM1_bit         _BIT_ACCESS(PSMC4BLNK,1)
// PSMC4REBS<P4REBSC1>
extern volatile __bit                   P4REBSC1            __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 P4REBSC1_bit        _BIT_ACCESS(PSMC4REBS,1)
// PSMC4REBS<P4REBSC2>
extern volatile __bit                   P4REBSC2            __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 P4REBSC2_bit        _BIT_ACCESS(PSMC4REBS,2)
// PSMC4REBS<P4REBSC3>
extern volatile __bit                   P4REBSC3            __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 P4REBSC3_bit        _BIT_ACCESS(PSMC4REBS,3)
// PSMC4REBS<P4REBSC4>
extern volatile __bit                   P4REBSC4            __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 P4REBSC4_bit        _BIT_ACCESS(PSMC4REBS,4)
// PSMC4REBS<P4REBSIN>
extern volatile __bit                   P4REBSIN            __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 P4REBSIN_bit        _BIT_ACCESS(PSMC4REBS,7)
// PSMC4STR1<P4SSYNC>
extern volatile __bit                   P4SSYNC             __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 P4SSYNC_bit         _BIT_ACCESS(PSMC4STR1,7)
// PSMC4STR0<P4STRA>
extern volatile __bit                   P4STRA              __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 P4STRA_bit          _BIT_ACCESS(PSMC4STR0,0)
// PSMC4STR0<P4STRB>
extern volatile __bit                   P4STRB              __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 P4STRB_bit          _BIT_ACCESS(PSMC4STR0,1)
// PSMC4SYNC<P4SYNC0>
extern volatile __bit                   P4SYNC0             __at(0x7898);	// @ (0xF13 * 8 + 0)
#define                                 P4SYNC0_bit         _BIT_ACCESS(PSMC4SYNC,0)
// PSMC4SYNC<P4SYNC1>
extern volatile __bit                   P4SYNC1             __at(0x7899);	// @ (0xF13 * 8 + 1)
#define                                 P4SYNC1_bit         _BIT_ACCESS(PSMC4SYNC,1)
// PSMC4SYNC<P4SYNC2>
extern volatile __bit                   P4SYNC2             __at(0x789A);	// @ (0xF13 * 8 + 2)
#define                                 P4SYNC2_bit         _BIT_ACCESS(PSMC4SYNC,2)
// PSMC4INT<P4TDCIE>
extern volatile __bit                   P4TDCIE             __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 P4TDCIE_bit         _BIT_ACCESS(PSMC4INT,5)
// PSMC4INT<P4TDCIF>
extern volatile __bit                   P4TDCIF             __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 P4TDCIF_bit         _BIT_ACCESS(PSMC4INT,1)
// PSMC4INT<P4TOVIE>
extern volatile __bit                   P4TOVIE             __at(0x7907);	// @ (0xF20 * 8 + 7)
#define                                 P4TOVIE_bit         _BIT_ACCESS(PSMC4INT,7)
// PSMC4INT<P4TOVIF>
extern volatile __bit                   P4TOVIF             __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 P4TOVIF_bit         _BIT_ACCESS(PSMC4INT,3)
// PSMC4INT<P4TPHIE>
extern volatile __bit                   P4TPHIE             __at(0x7906);	// @ (0xF20 * 8 + 6)
#define                                 P4TPHIE_bit         _BIT_ACCESS(PSMC4INT,6)
// PSMC4INT<P4TPHIF>
extern volatile __bit                   P4TPHIF             __at(0x7902);	// @ (0xF20 * 8 + 2)
