MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
#define                                 P4TPHIF_bit         _BIT_ACCESS(PSMC4INT,2)
// PSMC4INT<P4TPRIE>
extern volatile __bit                   P4TPRIE             __at(0x7904);	// @ (0xF20 * 8 + 4)
#define                                 P4TPRIE_bit         _BIT_ACCESS(PSMC4INT,4)
// PSMC4INT<P4TPRIF>
extern volatile __bit                   P4TPRIF             __at(0x7900);	// @ (0xF20 * 8 + 0)
#define                                 P4TPRIF_bit         _BIT_ACCESS(PSMC4INT,0)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// PIE4<PMSC3TIE>
extern volatile __bit                   PMSC3TIE            __at(0x4A6);	// @ (0x94 * 8 + 6)
#define                                 PMSC3TIE_bit        _BIT_ACCESS(PIE4,6)
// OPTION_REG<PS0>
extern volatile __bit                   PS0                 __at(0x4A8);	// @ (0x95 * 8 + 0)
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   PS1                 __at(0x4A9);	// @ (0x95 * 8 + 1)
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   PS2                 __at(0x4AA);	// @ (0x95 * 8 + 2)
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PSMC1BLKF<PSMC1BLKF0>
extern volatile __bit                   PSMC1BLKF0          __at(0x7560);	// @ (0xEAC * 8 + 0)
#define                                 PSMC1BLKF0_bit      _BIT_ACCESS(PSMC1BLKF,0)
// PSMC1BLKF<PSMC1BLKF1>
extern volatile __bit                   PSMC1BLKF1          __at(0x7561);	// @ (0xEAC * 8 + 1)
#define                                 PSMC1BLKF1_bit      _BIT_ACCESS(PSMC1BLKF,1)
// PSMC1BLKF<PSMC1BLKF2>
extern volatile __bit                   PSMC1BLKF2          __at(0x7562);	// @ (0xEAC * 8 + 2)
#define                                 PSMC1BLKF2_bit      _BIT_ACCESS(PSMC1BLKF,2)
// PSMC1BLKF<PSMC1BLKF3>
extern volatile __bit                   PSMC1BLKF3          __at(0x7563);	// @ (0xEAC * 8 + 3)
#define                                 PSMC1BLKF3_bit      _BIT_ACCESS(PSMC1BLKF,3)
// PSMC1BLKF<PSMC1BLKF4>
extern volatile __bit                   PSMC1BLKF4          __at(0x7564);	// @ (0xEAC * 8 + 4)
#define                                 PSMC1BLKF4_bit      _BIT_ACCESS(PSMC1BLKF,4)
// PSMC1BLKF<PSMC1BLKF5>
extern volatile __bit                   PSMC1BLKF5          __at(0x7565);	// @ (0xEAC * 8 + 5)
#define                                 PSMC1BLKF5_bit      _BIT_ACCESS(PSMC1BLKF,5)
// PSMC1BLKF<PSMC1BLKF6>
extern volatile __bit                   PSMC1BLKF6          __at(0x7566);	// @ (0xEAC * 8 + 6)
#define                                 PSMC1BLKF6_bit      _BIT_ACCESS(PSMC1BLKF,6)
// PSMC1BLKF<PSMC1BLKF7>
extern volatile __bit                   PSMC1BLKF7          __at(0x7567);	// @ (0xEAC * 8 + 7)
#define                                 PSMC1BLKF7_bit      _BIT_ACCESS(PSMC1BLKF,7)
// PSMC1BLKR<PSMC1BLKR0>
extern volatile __bit                   PSMC1BLKR0          __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 PSMC1BLKR0_bit      _BIT_ACCESS(PSMC1BLKR,0)
// PSMC1BLKR<PSMC1BLKR1>
extern volatile __bit                   PSMC1BLKR1          __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 PSMC1BLKR1_bit      _BIT_ACCESS(PSMC1BLKR,1)
// PSMC1BLKR<PSMC1BLKR2>
extern volatile __bit                   PSMC1BLKR2          __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 PSMC1BLKR2_bit      _BIT_ACCESS(PSMC1BLKR,2)
// PSMC1BLKR<PSMC1BLKR3>
extern volatile __bit                   PSMC1BLKR3          __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 PSMC1BLKR3_bit      _BIT_ACCESS(PSMC1BLKR,3)
// PSMC1BLKR<PSMC1BLKR4>
extern volatile __bit                   PSMC1BLKR4          __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 PSMC1BLKR4_bit      _BIT_ACCESS(PSMC1BLKR,4)
// PSMC1BLKR<PSMC1BLKR5>
extern volatile __bit                   PSMC1BLKR5          __at(0x755D);	// @ (0xEAB * 8 + 5)
#define                                 PSMC1BLKR5_bit      _BIT_ACCESS(PSMC1BLKR,5)
// PSMC1BLKR<PSMC1BLKR6>
extern volatile __bit                   PSMC1BLKR6          __at(0x755E);	// @ (0xEAB * 8 + 6)
#define                                 PSMC1BLKR6_bit      _BIT_ACCESS(PSMC1BLKR,6)
// PSMC1BLKR<PSMC1BLKR7>
extern volatile __bit                   PSMC1BLKR7          __at(0x755F);	// @ (0xEAB * 8 + 7)
#define                                 PSMC1BLKR7_bit      _BIT_ACCESS(PSMC1BLKR,7)
// PSMC1DBF<PSMC1DBF0>
extern volatile __bit                   PSMC1DBF0           __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 PSMC1DBF0_bit       _BIT_ACCESS(PSMC1DBF,0)
// PSMC1DBF<PSMC1DBF1>
extern volatile __bit                   PSMC1DBF1           __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 PSMC1DBF1_bit       _BIT_ACCESS(PSMC1DBF,1)
// PSMC1DBF<PSMC1DBF2>
extern volatile __bit                   PSMC1DBF2           __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 PSMC1DBF2_bit       _BIT_ACCESS(PSMC1DBF,2)
// PSMC1DBF<PSMC1DBF3>
extern volatile __bit                   PSMC1DBF3           __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 PSMC1DBF3_bit       _BIT_ACCESS(PSMC1DBF,3)
// PSMC1DBF<PSMC1DBF4>
extern volatile __bit                   PSMC1DBF4           __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 PSMC1DBF4_bit       _BIT_ACCESS(PSMC1DBF,4)
// PSMC1DBF<PSMC1DBF5>
extern volatile __bit                   PSMC1DBF5           __at(0x7555);	// @ (0xEAA * 8 + 5)
#define                                 PSMC1DBF5_bit       _BIT_ACCESS(PSMC1DBF,5)
// PSMC1DBF<PSMC1DBF6>
extern volatile __bit                   PSMC1DBF6           __at(0x7556);	// @ (0xEAA * 8 + 6)
#define                                 PSMC1DBF6_bit       _BIT_ACCESS(PSMC1DBF,6)
// PSMC1DBF<PSMC1DBF7>
extern volatile __bit                   PSMC1DBF7           __at(0x7557);	// @ (0xEAA * 8 + 7)
#define                                 PSMC1DBF7_bit       _BIT_ACCESS(PSMC1DBF,7)
// PSMC1DBR<PSMC1DBR0>
extern volatile __bit                   PSMC1DBR0           __at(0x7548);	// @ (0xEA9 * 8 + 0)
#define                                 PSMC1DBR0_bit       _BIT_ACCESS(PSMC1DBR,0)
// PSMC1DBR<PSMC1DBR1>
extern volatile __bit                   PSMC1DBR1           __at(0x7549);	// @ (0xEA9 * 8 + 1)
#define                                 PSMC1DBR1_bit       _BIT_ACCESS(PSMC1DBR,1)
// PSMC1DBR<PSMC1DBR2>
extern volatile __bit                   PSMC1DBR2           __at(0x754A);	// @ (0xEA9 * 8 + 2)
#define                                 PSMC1DBR2_bit       _BIT_ACCESS(PSMC1DBR,2)
// PSMC1DBR<PSMC1DBR3>
extern volatile __bit                   PSMC1DBR3           __at(0x754B);	// @ (0xEA9 * 8 + 3)
#define                                 PSMC1DBR3_bit       _BIT_ACCESS(PSMC1DBR,3)
// PSMC1DBR<PSMC1DBR4>
extern volatile __bit                   PSMC1DBR4           __at(0x754C);	// @ (0xEA9 * 8 + 4)
#define                                 PSMC1DBR4_bit       _BIT_ACCESS(PSMC1DBR,4)
// PSMC1DBR<PSMC1DBR5>
extern volatile __bit                   PSMC1DBR5           __at(0x754D);	// @ (0xEA9 * 8 + 5)
#define                                 PSMC1DBR5_bit       _BIT_ACCESS(PSMC1DBR,5)
// PSMC1DBR<PSMC1DBR6>
extern volatile __bit                   PSMC1DBR6           __at(0x754E);	// @ (0xEA9 * 8 + 6)
#define                                 PSMC1DBR6_bit       _BIT_ACCESS(PSMC1DBR,6)
// PSMC1DBR<PSMC1DBR7>
extern volatile __bit                   PSMC1DBR7           __at(0x754F);	// @ (0xEA9 * 8 + 7)
#define                                 PSMC1DBR7_bit       _BIT_ACCESS(PSMC1DBR,7)
// PSMC1DCL<PSMC1DC0>
extern volatile __bit                   PSMC1DC0            __at(0x7518);	// @ (0xEA3 * 8 + 0)
#define                                 PSMC1DC0_bit        _BIT_ACCESS(PSMC1DCL,0)
// PSMC1DCL<PSMC1DC1>
extern volatile __bit                   PSMC1DC1            __at(0x7519);	// @ (0xEA3 * 8 + 1)
#define                                 PSMC1DC1_bit        _BIT_ACCESS(PSMC1DCL,1)
// PSMC1DCH<PSMC1DC10>
extern volatile __bit                   PSMC1DC10           __at(0x7522);	// @ (0xEA4 * 8 + 2)
#define                                 PSMC1DC10_bit       _BIT_ACCESS(PSMC1DCH,2)
// PSMC1DCH<PSMC1DC11>
extern volatile __bit                   PSMC1DC11           __at(0x7523);	// @ (0xEA4 * 8 + 3)
#define                                 PSMC1DC11_bit       _BIT_ACCESS(PSMC1DCH,3)
// PSMC1DCH<PSMC1DC12>
extern volatile __bit                   PSMC1DC12           __at(0x7524);	// @ (0xEA4 * 8 + 4)
#define                                 PSMC1DC12_bit       _BIT_ACCESS(PSMC1DCH,4)
// PSMC1DCH<PSMC1DC13>
extern volatile __bit                   PSMC1DC13           __at(0x7525);	// @ (0xEA4 * 8 + 5)
#define                                 PSMC1DC13_bit       _BIT_ACCESS(PSMC1DCH,5)
// PSMC1DCH<PSMC1DC14>
extern volatile __bit                   PSMC1DC14           __at(0x7526);	// @ (0xEA4 * 8 + 6)
#define                                 PSMC1DC14_bit       _BIT_ACCESS(PSMC1DCH,6)
// PSMC1DCH<PSMC1DC15>
extern volatile __bit                   PSMC1DC15           __at(0x7527);	// @ (0xEA4 * 8 + 7)
#define                                 PSMC1DC15_bit       _BIT_ACCESS(PSMC1DCH,7)
// PSMC1DCL<PSMC1DC2>
extern volatile __bit                   PSMC1DC2            __at(0x751A);	// @ (0xEA3 * 8 + 2)
#define                                 PSMC1DC2_bit        _BIT_ACCESS(PSMC1DCL,2)
// PSMC1DCL<PSMC1DC3>
extern volatile __bit                   PSMC1DC3            __at(0x751B);	// @ (0xEA3 * 8 + 3)
#define                                 PSMC1DC3_bit        _BIT_ACCESS(PSMC1DCL,3)
// PSMC1DCL<PSMC1DC4>
extern volatile __bit                   PSMC1DC4            __at(0x751C);	// @ (0xEA3 * 8 + 4)
#define                                 PSMC1DC4_bit        _BIT_ACCESS(PSMC1DCL,4)
// PSMC1DCL<PSMC1DC5>
extern volatile __bit                   PSMC1DC5            __at(0x751D);	// @ (0xEA3 * 8 + 5)
#define                                 PSMC1DC5_bit        _BIT_ACCESS(PSMC1DCL,5)
// PSMC1DCL<PSMC1DC6>
extern volatile __bit                   PSMC1DC6            __at(0x751E);	// @ (0xEA3 * 8 + 6)
#define                                 PSMC1DC6_bit        _BIT_ACCESS(PSMC1DCL,6)
// PSMC1DCL<PSMC1DC7>
extern volatile __bit                   PSMC1DC7            __at(0x751F);	// @ (0xEA3 * 8 + 7)
#define                                 PSMC1DC7_bit        _BIT_ACCESS(PSMC1DCL,7)
// PSMC1DCH<PSMC1DC8>
extern volatile __bit                   PSMC1DC8            __at(0x7520);	// @ (0xEA4 * 8 + 0)
#define                                 PSMC1DC8_bit        _BIT_ACCESS(PSMC1DCH,0)
// PSMC1DCH<PSMC1DC9>
extern volatile __bit                   PSMC1DC9            __at(0x7521);	// @ (0xEA4 * 8 + 1)
#define                                 PSMC1DC9_bit        _BIT_ACCESS(PSMC1DCH,1)
// PSMC1CON<PSMC1EN>
extern volatile __bit                   PSMC1EN             __at(0x748F);	// @ (0xE91 * 8 + 7)
#define                                 PSMC1EN_bit         _BIT_ACCESS(PSMC1CON,7)
// PSMC1FFA<PSMC1FFA0>
extern volatile __bit                   PSMC1FFA0           __at(0x7568);	// @ (0xEAD * 8 + 0)
#define                                 PSMC1FFA0_bit       _BIT_ACCESS(PSMC1FFA,0)
// PSMC1FFA<PSMC1FFA1>
extern volatile __bit                   PSMC1FFA1           __at(0x7569);	// @ (0xEAD * 8 + 1)
#define                                 PSMC1FFA1_bit       _BIT_ACCESS(PSMC1FFA,1)
// PSMC1FFA<PSMC1FFA2>
extern volatile __bit                   PSMC1FFA2           __at(0x756A);	// @ (0xEAD * 8 + 2)
#define                                 PSMC1FFA2_bit       _BIT_ACCESS(PSMC1FFA,2)
// PSMC1FFA<PSMC1FFA3>
extern volatile __bit                   PSMC1FFA3           __at(0x756B);	// @ (0xEAD * 8 + 3)
#define                                 PSMC1FFA3_bit       _BIT_ACCESS(PSMC1FFA,3)
// PSMC1CON<PSMC1LD>
extern volatile __bit                   PSMC1LD             __at(0x748E);	// @ (0xE91 * 8 + 6)
#define                                 PSMC1LD_bit         _BIT_ACCESS(PSMC1CON,6)
// PSMC1PHL<PSMC1PH0>
extern volatile __bit                   PSMC1PH0            __at(0x7508);	// @ (0xEA1 * 8 + 0)
#define                                 PSMC1PH0_bit        _BIT_ACCESS(PSMC1PHL,0)
// PSMC1PHL<PSMC1PH1>
extern volatile __bit                   PSMC1PH1            __at(0x7509);	// @ (0xEA1 * 8 + 1)
#define                                 PSMC1PH1_bit        _BIT_ACCESS(PSMC1PHL,1)
// PSMC1PHH<PSMC1PH10>
extern volatile __bit                   PSMC1PH10           __at(0x7512);	// @ (0xEA2 * 8 + 2)
#define                                 PSMC1PH10_bit       _BIT_ACCESS(PSMC1PHH,2)
// PSMC1PHH<PSMC1PH11>
extern volatile __bit                   PSMC1PH11           __at(0x7513);	// @ (0xEA2 * 8 + 3)
#define                                 PSMC1PH11_bit       _BIT_ACCESS(PSMC1PHH,3)
// PSMC1PHH<PSMC1PH12>
extern volatile __bit                   PSMC1PH12           __at(0x7514);	// @ (0xEA2 * 8 + 4)
#define                                 PSMC1PH12_bit       _BIT_ACCESS(PSMC1PHH,4)
// PSMC1PHH<PSMC1PH13>
extern volatile __bit                   PSMC1PH13           __at(0x7515);	// @ (0xEA2 * 8 + 5)
#define                                 PSMC1PH13_bit       _BIT_ACCESS(PSMC1PHH,5)
// PSMC1PHH<PSMC1PH14>
extern volatile __bit                   PSMC1PH14           __at(0x7516);	// @ (0xEA2 * 8 + 6)
#define                                 PSMC1PH14_bit       _BIT_ACCESS(PSMC1PHH,6)
// PSMC1PHH<PSMC1PH15>
extern volatile __bit                   PSMC1PH15           __at(0x7517);	// @ (0xEA2 * 8 + 7)
#define                                 PSMC1PH15_bit       _BIT_ACCESS(PSMC1PHH,7)
// PSMC1PHL<PSMC1PH2>
extern volatile __bit                   PSMC1PH2            __at(0x750A);	// @ (0xEA1 * 8 + 2)
#define                                 PSMC1PH2_bit        _BIT_ACCESS(PSMC1PHL,2)
// PSMC1PHL<PSMC1PH3>
extern volatile __bit                   PSMC1PH3            __at(0x750B);	// @ (0xEA1 * 8 + 3)
#define                                 PSMC1PH3_bit        _BIT_ACCESS(PSMC1PHL,3)
// PSMC1PHL<PSMC1PH4>
extern volatile __bit                   PSMC1PH4            __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 PSMC1PH4_bit        _BIT_ACCESS(PSMC1PHL,4)
// PSMC1PHL<PSMC1PH5>
extern volatile __bit                   PSMC1PH5            __at(0x750D);	// @ (0xEA1 * 8 + 5)
#define                                 PSMC1PH5_bit        _BIT_ACCESS(PSMC1PHL,5)
// PSMC1PHL<PSMC1PH6>
extern volatile __bit                   PSMC1PH6            __at(0x750E);	// @ (0xEA1 * 8 + 6)
#define                                 PSMC1PH6_bit        _BIT_ACCESS(PSMC1PHL,6)
// PSMC1PHL<PSMC1PH7>
extern volatile __bit                   PSMC1PH7            __at(0x750F);	// @ (0xEA1 * 8 + 7)
#define                                 PSMC1PH7_bit        _BIT_ACCESS(PSMC1PHL,7)
// PSMC1PHH<PSMC1PH8>
extern volatile __bit                   PSMC1PH8            __at(0x7510);	// @ (0xEA2 * 8 + 0)
#define                                 PSMC1PH8_bit        _BIT_ACCESS(PSMC1PHH,0)
// PSMC1PHH<PSMC1PH9>
extern volatile __bit                   PSMC1PH9            __at(0x7511);	// @ (0xEA2 * 8 + 1)
#define                                 PSMC1PH9_bit        _BIT_ACCESS(PSMC1PHH,1)
// PSMC1PRL<PSMC1PR0>
extern volatile __bit                   PSMC1PR0            __at(0x7528);	// @ (0xEA5 * 8 + 0)
#define                                 PSMC1PR0_bit        _BIT_ACCESS(PSMC1PRL,0)
// PSMC1PRL<PSMC1PR1>
extern volatile __bit                   PSMC1PR1            __at(0x7529);	// @ (0xEA5 * 8 + 1)
#define                                 PSMC1PR1_bit        _BIT_ACCESS(PSMC1PRL,1)
// PSMC1PRH<PSMC1PR10>
extern volatile __bit                   PSMC1PR10           __at(0x7532);	// @ (0xEA6 * 8 + 2)
#define                                 PSMC1PR10_bit       _BIT_ACCESS(PSMC1PRH,2)
// PSMC1PRH<PSMC1PR11>
extern volatile __bit                   PSMC1PR11           __at(0x7533);	// @ (0xEA6 * 8 + 3)
#define                                 PSMC1PR11_bit       _BIT_ACCESS(PSMC1PRH,3)
// PSMC1PRH<PSMC1PR12>
extern volatile __bit                   PSMC1PR12           __at(0x7534);	// @ (0xEA6 * 8 + 4)
#define                                 PSMC1PR12_bit       _BIT_ACCESS(PSMC1PRH,4)
// PSMC1PRH<PSMC1PR13>
extern volatile __bit                   PSMC1PR13           __at(0x7535);	// @ (0xEA6 * 8 + 5)
#define                                 PSMC1PR13_bit       _BIT_ACCESS(PSMC1PRH,5)
// PSMC1PRH<PSMC1PR14>
extern volatile __bit                   PSMC1PR14           __at(0x7536);	// @ (0xEA6 * 8 + 6)
#define                                 PSMC1PR14_bit       _BIT_ACCESS(PSMC1PRH,6)
// PSMC1PRH<PSMC1PR15>
extern volatile __bit                   PSMC1PR15           __at(0x7537);	// @ (0xEA6 * 8 + 7)
#define                                 PSMC1PR15_bit       _BIT_ACCESS(PSMC1PRH,7)
// PSMC1PRL<PSMC1PR2>
extern volatile __bit                   PSMC1PR2            __at(0x752A);	// @ (0xEA5 * 8 + 2)
#define                                 PSMC1PR2_bit        _BIT_ACCESS(PSMC1PRL,2)
// PSMC1PRL<PSMC1PR3>
extern volatile __bit                   PSMC1PR3            __at(0x752B);	// @ (0xEA5 * 8 + 3)
#define                                 PSMC1PR3_bit        _BIT_ACCESS(PSMC1PRL,3)
// PSMC1PRL<PSMC1PR4>
extern volatile __bit                   PSMC1PR4            __at(0x752C);	// @ (0xEA5 * 8 + 4)
#define                                 PSMC1PR4_bit        _BIT_ACCESS(PSMC1PRL,4)
// PSMC1PRL<PSMC1PR5>
extern volatile __bit                   PSMC1PR5            __at(0x752D);	// @ (0xEA5 * 8 + 5)
#define                                 PSMC1PR5_bit        _BIT_ACCESS(PSMC1PRL,5)
// PSMC1PRL<PSMC1PR6>
extern volatile __bit                   PSMC1PR6            __at(0x752E);	// @ (0xEA5 * 8 + 6)
#define                                 PSMC1PR6_bit        _BIT_ACCESS(PSMC1PRL,6)
// PSMC1PRL<PSMC1PR7>
extern volatile __bit                   PSMC1PR7            __at(0x752F);	// @ (0xEA5 * 8 + 7)
#define                                 PSMC1PR7_bit        _BIT_ACCESS(PSMC1PRL,7)
// PSMC1PRH<PSMC1PR8>
extern volatile __bit                   PSMC1PR8            __at(0x7530);	// @ (0xEA6 * 8 + 0)
#define                                 PSMC1PR8_bit        _BIT_ACCESS(PSMC1PRH,0)
// PSMC1PRH<PSMC1PR9>
extern volatile __bit                   PSMC1PR9            __at(0x7531);	// @ (0xEA6 * 8 + 1)
#define                                 PSMC1PR9_bit        _BIT_ACCESS(PSMC1PRH,1)
// PIE4<PSMC1SIE>
extern volatile __bit                   PSMC1SIE            __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 PSMC1SIE_bit        _BIT_ACCESS(PIE4,0)
// PIR4<PSMC1SIF>
extern volatile __bit                   PSMC1SIF            __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 PSMC1SIF_bit        _BIT_ACCESS(PIR4,0)
// PIE4<PSMC1TIE>
extern volatile __bit                   PSMC1TIE            __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 PSMC1TIE_bit        _BIT_ACCESS(PIE4,4)
// PIR4<PSMC1TIF>
extern volatile __bit                   PSMC1TIF            __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 PSMC1TIF_bit        _BIT_ACCESS(PIR4,4)
// PSMC1TMRL<PSMC1TMR0>
extern volatile __bit                   PSMC1TMR0           __at(0x7538);	// @ (0xEA7 * 8 + 0)
#define                                 PSMC1TMR0_bit       _BIT_ACCESS(PSMC1TMRL,0)
// PSMC1TMRL<PSMC1TMR1>
extern volatile __bit                   PSMC1TMR1           __at(0x7539);	// @ (0xEA7 * 8 + 1)
#define                                 PSMC1TMR1_bit       _BIT_ACCESS(PSMC1TMRL,1)
// PSMC1TMRH<PSMC1TMR10>
extern volatile __bit                   PSMC1TMR10          __at(0x7542);	// @ (0xEA8 * 8 + 2)
#define                                 PSMC1TMR10_bit      _BIT_ACCESS(PSMC1TMRH,2)
// PSMC1TMRH<PSMC1TMR11>
extern volatile __bit                   PSMC1TMR11          __at(0x7543);	// @ (0xEA8 * 8 + 3)
#define                                 PSMC1TMR11_bit      _BIT_ACCESS(PSMC1TMRH,3)
// PSMC1TMRH<PSMC1TMR12>
extern volatile __bit                   PSMC1TMR12          __at(0x7544);	// @ (0xEA8 * 8 + 4)
#define                                 PSMC1TMR12_bit      _BIT_ACCESS(PSMC1TMRH,4)
// PSMC1TMRH<PSMC1TMR13>
extern volatile __bit                   PSMC1TMR13          __at(0x7545);	// @ (0xEA8 * 8 + 5)
#define                                 PSMC1TMR13_bit      _BIT_ACCESS(PSMC1TMRH,5)
// PSMC1TMRH<PSMC1TMR14>
extern volatile __bit                   PSMC1TMR14          __at(0x7546);	// @ (0xEA8 * 8 + 6)
#define                                 PSMC1TMR14_bit      _BIT_ACCESS(PSMC1TMRH,6)
// PSMC1TMRH<PSMC1TMR15>
extern volatile __bit                   PSMC1TMR15          __at(0x7547);	// @ (0xEA8 * 8 + 7)
#define                                 PSMC1TMR15_bit      _BIT_ACCESS(PSMC1TMRH,7)
// PSMC1TMRL<PSMC1TMR2>
extern volatile __bit                   PSMC1TMR2           __at(0x753A);	// @ (0xEA7 * 8 + 2)
#define                                 PSMC1TMR2_bit       _BIT_ACCESS(PSMC1TMRL,2)
// PSMC1TMRL<PSMC1TMR3>
extern volatile __bit                   PSMC1TMR3           __at(0x753B);	// @ (0xEA7 * 8 + 3)
#define                                 PSMC1TMR3_bit       _BIT_ACCESS(PSMC1TMRL,3)
// PSMC1TMRL<PSMC1TMR4>
extern volatile __bit                   PSMC1TMR4           __at(0x753C);	// @ (0xEA7 * 8 + 4)
#define                                 PSMC1TMR4_bit       _BIT_ACCESS(PSMC1TMRL,4)
// PSMC1TMRL<PSMC1TMR5>
extern volatile __bit                   PSMC1TMR5           __at(0x753D);	// @ (0xEA7 * 8 + 5)
#define                                 PSMC1TMR5_bit       _BIT_ACCESS(PSMC1TMRL,5)
// PSMC1TMRL<PSMC1TMR6>
extern volatile __bit                   PSMC1TMR6           __at(0x753E);	// @ (0xEA7 * 8 + 6)
#define                                 PSMC1TMR6_bit       _BIT_ACCESS(PSMC1TMRL,6)
// PSMC1TMRL<PSMC1TMR7>
extern volatile __bit                   PSMC1TMR7           __at(0x753F);	// @ (0xEA7 * 8 + 7)
#define                                 PSMC1TMR7_bit       _BIT_ACCESS(PSMC1TMRL,7)
// PSMC1TMRH<PSMC1TMR8>
extern volatile __bit                   PSMC1TMR8           __at(0x7540);	// @ (0xEA8 * 8 + 0)
#define                                 PSMC1TMR8_bit       _BIT_ACCESS(PSMC1TMRH,0)
// PSMC1TMRH<PSMC1TMR9>
extern volatile __bit                   PSMC1TMR9           __at(0x7541);	// @ (0xEA8 * 8 + 1)
#define                                 PSMC1TMR9_bit       _BIT_ACCESS(PSMC1TMRH,1)
// PSMC2BLKF<PSMC2BLKF0>
extern volatile __bit                   PSMC2BLKF0          __at(0x7660);	// @ (0xECC * 8 + 0)
#define                                 PSMC2BLKF0_bit      _BIT_ACCESS(PSMC2BLKF,0)
// PSMC2BLKF<PSMC2BLKF1>
extern volatile __bit                   PSMC2BLKF1          __at(0x7661);	// @ (0xECC * 8 + 1)
