MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
#define                                 PSMC4DBR2_bit       _BIT_ACCESS(PSMC4DBR,2)
// PSMC4DBR<PSMC4DBR3>
extern volatile __bit                   PSMC4DBR3           __at(0x794B);	// @ (0xF29 * 8 + 3)
#define                                 PSMC4DBR3_bit       _BIT_ACCESS(PSMC4DBR,3)
// PSMC4DBR<PSMC4DBR4>
extern volatile __bit                   PSMC4DBR4           __at(0x794C);	// @ (0xF29 * 8 + 4)
#define                                 PSMC4DBR4_bit       _BIT_ACCESS(PSMC4DBR,4)
// PSMC4DBR<PSMC4DBR5>
extern volatile __bit                   PSMC4DBR5           __at(0x794D);	// @ (0xF29 * 8 + 5)
#define                                 PSMC4DBR5_bit       _BIT_ACCESS(PSMC4DBR,5)
// PSMC4DBR<PSMC4DBR6>
extern volatile __bit                   PSMC4DBR6           __at(0x794E);	// @ (0xF29 * 8 + 6)
#define                                 PSMC4DBR6_bit       _BIT_ACCESS(PSMC4DBR,6)
// PSMC4DBR<PSMC4DBR7>
extern volatile __bit                   PSMC4DBR7           __at(0x794F);	// @ (0xF29 * 8 + 7)
#define                                 PSMC4DBR7_bit       _BIT_ACCESS(PSMC4DBR,7)
// PSMC4DCL<PSMC4DC0>
extern volatile __bit                   PSMC4DC0            __at(0x7918);	// @ (0xF23 * 8 + 0)
#define                                 PSMC4DC0_bit        _BIT_ACCESS(PSMC4DCL,0)
// PSMC4DCL<PSMC4DC1>
extern volatile __bit                   PSMC4DC1            __at(0x7919);	// @ (0xF23 * 8 + 1)
#define                                 PSMC4DC1_bit        _BIT_ACCESS(PSMC4DCL,1)
// PSMC4DCH<PSMC4DC10>
extern volatile __bit                   PSMC4DC10           __at(0x7922);	// @ (0xF24 * 8 + 2)
#define                                 PSMC4DC10_bit       _BIT_ACCESS(PSMC4DCH,2)
// PSMC4DCH<PSMC4DC11>
extern volatile __bit                   PSMC4DC11           __at(0x7923);	// @ (0xF24 * 8 + 3)
#define                                 PSMC4DC11_bit       _BIT_ACCESS(PSMC4DCH,3)
// PSMC4DCH<PSMC4DC12>
extern volatile __bit                   PSMC4DC12           __at(0x7924);	// @ (0xF24 * 8 + 4)
#define                                 PSMC4DC12_bit       _BIT_ACCESS(PSMC4DCH,4)
// PSMC4DCH<PSMC4DC13>
extern volatile __bit                   PSMC4DC13           __at(0x7925);	// @ (0xF24 * 8 + 5)
#define                                 PSMC4DC13_bit       _BIT_ACCESS(PSMC4DCH,5)
// PSMC4DCH<PSMC4DC14>
extern volatile __bit                   PSMC4DC14           __at(0x7926);	// @ (0xF24 * 8 + 6)
#define                                 PSMC4DC14_bit       _BIT_ACCESS(PSMC4DCH,6)
// PSMC4DCH<PSMC4DC15>
extern volatile __bit                   PSMC4DC15           __at(0x7927);	// @ (0xF24 * 8 + 7)
#define                                 PSMC4DC15_bit       _BIT_ACCESS(PSMC4DCH,7)
// PSMC4DCL<PSMC4DC2>
extern volatile __bit                   PSMC4DC2            __at(0x791A);	// @ (0xF23 * 8 + 2)
#define                                 PSMC4DC2_bit        _BIT_ACCESS(PSMC4DCL,2)
// PSMC4DCL<PSMC4DC3>
extern volatile __bit                   PSMC4DC3            __at(0x791B);	// @ (0xF23 * 8 + 3)
#define                                 PSMC4DC3_bit        _BIT_ACCESS(PSMC4DCL,3)
// PSMC4DCL<PSMC4DC4>
extern volatile __bit                   PSMC4DC4            __at(0x791C);	// @ (0xF23 * 8 + 4)
#define                                 PSMC4DC4_bit        _BIT_ACCESS(PSMC4DCL,4)
// PSMC4DCL<PSMC4DC5>
extern volatile __bit                   PSMC4DC5            __at(0x791D);	// @ (0xF23 * 8 + 5)
#define                                 PSMC4DC5_bit        _BIT_ACCESS(PSMC4DCL,5)
// PSMC4DCL<PSMC4DC6>
extern volatile __bit                   PSMC4DC6            __at(0x791E);	// @ (0xF23 * 8 + 6)
#define                                 PSMC4DC6_bit        _BIT_ACCESS(PSMC4DCL,6)
// PSMC4DCL<PSMC4DC7>
extern volatile __bit                   PSMC4DC7            __at(0x791F);	// @ (0xF23 * 8 + 7)
#define                                 PSMC4DC7_bit        _BIT_ACCESS(PSMC4DCL,7)
// PSMC4DCH<PSMC4DC8>
extern volatile __bit                   PSMC4DC8            __at(0x7920);	// @ (0xF24 * 8 + 0)
#define                                 PSMC4DC8_bit        _BIT_ACCESS(PSMC4DCH,0)
// PSMC4DCH<PSMC4DC9>
extern volatile __bit                   PSMC4DC9            __at(0x7921);	// @ (0xF24 * 8 + 1)
#define                                 PSMC4DC9_bit        _BIT_ACCESS(PSMC4DCH,1)
// PSMC4CON<PSMC4EN>
extern volatile __bit                   PSMC4EN             __at(0x788F);	// @ (0xF11 * 8 + 7)
#define                                 PSMC4EN_bit         _BIT_ACCESS(PSMC4CON,7)
// PSMC4FFA<PSMC4FFA0>
extern volatile __bit                   PSMC4FFA0           __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 PSMC4FFA0_bit       _BIT_ACCESS(PSMC4FFA,0)
// PSMC4FFA<PSMC4FFA1>
extern volatile __bit                   PSMC4FFA1           __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 PSMC4FFA1_bit       _BIT_ACCESS(PSMC4FFA,1)
// PSMC4FFA<PSMC4FFA2>
extern volatile __bit                   PSMC4FFA2           __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 PSMC4FFA2_bit       _BIT_ACCESS(PSMC4FFA,2)
// PSMC4FFA<PSMC4FFA3>
extern volatile __bit                   PSMC4FFA3           __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 PSMC4FFA3_bit       _BIT_ACCESS(PSMC4FFA,3)
// PSMC4CON<PSMC4LD>
extern volatile __bit                   PSMC4LD             __at(0x788E);	// @ (0xF11 * 8 + 6)
#define                                 PSMC4LD_bit         _BIT_ACCESS(PSMC4CON,6)
// PSMC4PHL<PSMC4PH0>
extern volatile __bit                   PSMC4PH0            __at(0x7908);	// @ (0xF21 * 8 + 0)
#define                                 PSMC4PH0_bit        _BIT_ACCESS(PSMC4PHL,0)
// PSMC4PHL<PSMC4PH1>
extern volatile __bit                   PSMC4PH1            __at(0x7909);	// @ (0xF21 * 8 + 1)
#define                                 PSMC4PH1_bit        _BIT_ACCESS(PSMC4PHL,1)
// PSMC4PHH<PSMC4PH10>
extern volatile __bit                   PSMC4PH10           __at(0x7912);	// @ (0xF22 * 8 + 2)
#define                                 PSMC4PH10_bit       _BIT_ACCESS(PSMC4PHH,2)
// PSMC4PHH<PSMC4PH11>
extern volatile __bit                   PSMC4PH11           __at(0x7913);	// @ (0xF22 * 8 + 3)
#define                                 PSMC4PH11_bit       _BIT_ACCESS(PSMC4PHH,3)
// PSMC4PHH<PSMC4PH12>
extern volatile __bit                   PSMC4PH12           __at(0x7914);	// @ (0xF22 * 8 + 4)
#define                                 PSMC4PH12_bit       _BIT_ACCESS(PSMC4PHH,4)
// PSMC4PHH<PSMC4PH13>
extern volatile __bit                   PSMC4PH13           __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 PSMC4PH13_bit       _BIT_ACCESS(PSMC4PHH,5)
// PSMC4PHH<PSMC4PH14>
extern volatile __bit                   PSMC4PH14           __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 PSMC4PH14_bit       _BIT_ACCESS(PSMC4PHH,6)
// PSMC4PHH<PSMC4PH15>
extern volatile __bit                   PSMC4PH15           __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 PSMC4PH15_bit       _BIT_ACCESS(PSMC4PHH,7)
// PSMC4PHL<PSMC4PH2>
extern volatile __bit                   PSMC4PH2            __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 PSMC4PH2_bit        _BIT_ACCESS(PSMC4PHL,2)
// PSMC4PHL<PSMC4PH3>
extern volatile __bit                   PSMC4PH3            __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 PSMC4PH3_bit        _BIT_ACCESS(PSMC4PHL,3)
// PSMC4PHL<PSMC4PH4>
extern volatile __bit                   PSMC4PH4            __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 PSMC4PH4_bit        _BIT_ACCESS(PSMC4PHL,4)
// PSMC4PHL<PSMC4PH5>
extern volatile __bit                   PSMC4PH5            __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 PSMC4PH5_bit        _BIT_ACCESS(PSMC4PHL,5)
// PSMC4PHL<PSMC4PH6>
extern volatile __bit                   PSMC4PH6            __at(0x790E);	// @ (0xF21 * 8 + 6)
#define                                 PSMC4PH6_bit        _BIT_ACCESS(PSMC4PHL,6)
// PSMC4PHL<PSMC4PH7>
extern volatile __bit                   PSMC4PH7            __at(0x790F);	// @ (0xF21 * 8 + 7)
#define                                 PSMC4PH7_bit        _BIT_ACCESS(PSMC4PHL,7)
// PSMC4PHH<PSMC4PH8>
extern volatile __bit                   PSMC4PH8            __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 PSMC4PH8_bit        _BIT_ACCESS(PSMC4PHH,0)
// PSMC4PHH<PSMC4PH9>
extern volatile __bit                   PSMC4PH9            __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 PSMC4PH9_bit        _BIT_ACCESS(PSMC4PHH,1)
// PSMC4PRL<PSMC4PR0>
extern volatile __bit                   PSMC4PR0            __at(0x7928);	// @ (0xF25 * 8 + 0)
#define                                 PSMC4PR0_bit        _BIT_ACCESS(PSMC4PRL,0)
// PSMC4PRL<PSMC4PR1>
extern volatile __bit                   PSMC4PR1            __at(0x7929);	// @ (0xF25 * 8 + 1)
#define                                 PSMC4PR1_bit        _BIT_ACCESS(PSMC4PRL,1)
// PSMC4PRH<PSMC4PR10>
extern volatile __bit                   PSMC4PR10           __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 PSMC4PR10_bit       _BIT_ACCESS(PSMC4PRH,2)
// PSMC4PRH<PSMC4PR11>
extern volatile __bit                   PSMC4PR11           __at(0x7933);	// @ (0xF26 * 8 + 3)
#define                                 PSMC4PR11_bit       _BIT_ACCESS(PSMC4PRH,3)
// PSMC4PRH<PSMC4PR12>
extern volatile __bit                   PSMC4PR12           __at(0x7934);	// @ (0xF26 * 8 + 4)
#define                                 PSMC4PR12_bit       _BIT_ACCESS(PSMC4PRH,4)
// PSMC4PRH<PSMC4PR13>
extern volatile __bit                   PSMC4PR13           __at(0x7935);	// @ (0xF26 * 8 + 5)
#define                                 PSMC4PR13_bit       _BIT_ACCESS(PSMC4PRH,5)
// PSMC4PRH<PSMC4PR14>
extern volatile __bit                   PSMC4PR14           __at(0x7936);	// @ (0xF26 * 8 + 6)
#define                                 PSMC4PR14_bit       _BIT_ACCESS(PSMC4PRH,6)
// PSMC4PRH<PSMC4PR15>
extern volatile __bit                   PSMC4PR15           __at(0x7937);	// @ (0xF26 * 8 + 7)
#define                                 PSMC4PR15_bit       _BIT_ACCESS(PSMC4PRH,7)
// PSMC4PRL<PSMC4PR2>
extern volatile __bit                   PSMC4PR2            __at(0x792A);	// @ (0xF25 * 8 + 2)
#define                                 PSMC4PR2_bit        _BIT_ACCESS(PSMC4PRL,2)
// PSMC4PRL<PSMC4PR3>
extern volatile __bit                   PSMC4PR3            __at(0x792B);	// @ (0xF25 * 8 + 3)
#define                                 PSMC4PR3_bit        _BIT_ACCESS(PSMC4PRL,3)
// PSMC4PRL<PSMC4PR4>
extern volatile __bit                   PSMC4PR4            __at(0x792C);	// @ (0xF25 * 8 + 4)
#define                                 PSMC4PR4_bit        _BIT_ACCESS(PSMC4PRL,4)
// PSMC4PRL<PSMC4PR5>
extern volatile __bit                   PSMC4PR5            __at(0x792D);	// @ (0xF25 * 8 + 5)
#define                                 PSMC4PR5_bit        _BIT_ACCESS(PSMC4PRL,5)
// PSMC4PRL<PSMC4PR6>
extern volatile __bit                   PSMC4PR6            __at(0x792E);	// @ (0xF25 * 8 + 6)
#define                                 PSMC4PR6_bit        _BIT_ACCESS(PSMC4PRL,6)
// PSMC4PRL<PSMC4PR7>
extern volatile __bit                   PSMC4PR7            __at(0x792F);	// @ (0xF25 * 8 + 7)
#define                                 PSMC4PR7_bit        _BIT_ACCESS(PSMC4PRL,7)
// PSMC4PRH<PSMC4PR8>
extern volatile __bit                   PSMC4PR8            __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 PSMC4PR8_bit        _BIT_ACCESS(PSMC4PRH,0)
// PSMC4PRH<PSMC4PR9>
extern volatile __bit                   PSMC4PR9            __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 PSMC4PR9_bit        _BIT_ACCESS(PSMC4PRH,1)
// PIE4<PSMC4SIE>
extern volatile __bit                   PSMC4SIE            __at(0x4A3);	// @ (0x94 * 8 + 3)
#define                                 PSMC4SIE_bit        _BIT_ACCESS(PIE4,3)
// PIR4<PSMC4SIF>
extern volatile __bit                   PSMC4SIF            __at(0xA3);	// @ (0x14 * 8 + 3)
#define                                 PSMC4SIF_bit        _BIT_ACCESS(PIR4,3)
// PIE4<PSMC4TIE>
extern volatile __bit                   PSMC4TIE            __at(0x4A7);	// @ (0x94 * 8 + 7)
#define                                 PSMC4TIE_bit        _BIT_ACCESS(PIE4,7)
// PIR4<PSMC4TIF>
extern volatile __bit                   PSMC4TIF            __at(0xA7);	// @ (0x14 * 8 + 7)
#define                                 PSMC4TIF_bit        _BIT_ACCESS(PIR4,7)
// PSMC4TMRL<PSMC4TMR0>
extern volatile __bit                   PSMC4TMR0           __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 PSMC4TMR0_bit       _BIT_ACCESS(PSMC4TMRL,0)
// PSMC4TMRL<PSMC4TMR1>
extern volatile __bit                   PSMC4TMR1           __at(0x7939);	// @ (0xF27 * 8 + 1)
#define                                 PSMC4TMR1_bit       _BIT_ACCESS(PSMC4TMRL,1)
// PSMC4TMRH<PSMC4TMR10>
extern volatile __bit                   PSMC4TMR10          __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 PSMC4TMR10_bit      _BIT_ACCESS(PSMC4TMRH,2)
// PSMC4TMRH<PSMC4TMR11>
extern volatile __bit                   PSMC4TMR11          __at(0x7943);	// @ (0xF28 * 8 + 3)
#define                                 PSMC4TMR11_bit      _BIT_ACCESS(PSMC4TMRH,3)
// PSMC4TMRH<PSMC4TMR12>
extern volatile __bit                   PSMC4TMR12          __at(0x7944);	// @ (0xF28 * 8 + 4)
#define                                 PSMC4TMR12_bit      _BIT_ACCESS(PSMC4TMRH,4)
// PSMC4TMRH<PSMC4TMR13>
extern volatile __bit                   PSMC4TMR13          __at(0x7945);	// @ (0xF28 * 8 + 5)
#define                                 PSMC4TMR13_bit      _BIT_ACCESS(PSMC4TMRH,5)
// PSMC4TMRH<PSMC4TMR14>
extern volatile __bit                   PSMC4TMR14          __at(0x7946);	// @ (0xF28 * 8 + 6)
#define                                 PSMC4TMR14_bit      _BIT_ACCESS(PSMC4TMRH,6)
// PSMC4TMRH<PSMC4TMR15>
extern volatile __bit                   PSMC4TMR15          __at(0x7947);	// @ (0xF28 * 8 + 7)
#define                                 PSMC4TMR15_bit      _BIT_ACCESS(PSMC4TMRH,7)
// PSMC4TMRL<PSMC4TMR2>
extern volatile __bit                   PSMC4TMR2           __at(0x793A);	// @ (0xF27 * 8 + 2)
#define                                 PSMC4TMR2_bit       _BIT_ACCESS(PSMC4TMRL,2)
// PSMC4TMRL<PSMC4TMR3>
extern volatile __bit                   PSMC4TMR3           __at(0x793B);	// @ (0xF27 * 8 + 3)
#define                                 PSMC4TMR3_bit       _BIT_ACCESS(PSMC4TMRL,3)
// PSMC4TMRL<PSMC4TMR4>
extern volatile __bit                   PSMC4TMR4           __at(0x793C);	// @ (0xF27 * 8 + 4)
#define                                 PSMC4TMR4_bit       _BIT_ACCESS(PSMC4TMRL,4)
// PSMC4TMRL<PSMC4TMR5>
extern volatile __bit                   PSMC4TMR5           __at(0x793D);	// @ (0xF27 * 8 + 5)
#define                                 PSMC4TMR5_bit       _BIT_ACCESS(PSMC4TMRL,5)
// PSMC4TMRL<PSMC4TMR6>
extern volatile __bit                   PSMC4TMR6           __at(0x793E);	// @ (0xF27 * 8 + 6)
#define                                 PSMC4TMR6_bit       _BIT_ACCESS(PSMC4TMRL,6)
// PSMC4TMRL<PSMC4TMR7>
extern volatile __bit                   PSMC4TMR7           __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 PSMC4TMR7_bit       _BIT_ACCESS(PSMC4TMRL,7)
// PSMC4TMRH<PSMC4TMR8>
extern volatile __bit                   PSMC4TMR8           __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 PSMC4TMR8_bit       _BIT_ACCESS(PSMC4TMRH,0)
// PSMC4TMRH<PSMC4TMR9>
extern volatile __bit                   PSMC4TMR9           __at(0x7941);	// @ (0xF28 * 8 + 1)
#define                                 PSMC4TMR9_bit       _BIT_ACCESS(PSMC4TMRH,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x66);	// @ (0xC * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x67);	// @ (0xC * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x68);	// @ (0xD * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x69);	// @ (0xD * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x6B);	// @ (0xD * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0xCFE);	// @ (0x19F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x78);	// @ (0xF * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x79);	// @ (0xF * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7A);	// @ (0xF * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7B);	// @ (0xF * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C);	// @ (0xF * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7D);	// @ (0xF * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7E);	// @ (0xF * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7F);	// @ (0xF * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
