MikroElektronika/core_packages/PIC/XC8/def/PIC16F1789/mcu.h
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// APFCON1<RXSEL>
extern volatile __bit                   RXSEL               __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 RXSEL_bit           _BIT_ACCESS(APFCON1,1)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// APFCON1<SCKSEL>
extern volatile __bit                   SCKSEL              __at(0x8EC);	// @ (0x11D * 8 + 4)
#define                                 SCKSEL_bit          _BIT_ACCESS(APFCON1,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// APFCON1<SDISEL>
extern volatile __bit                   SDISEL              __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 SDISEL_bit          _BIT_ACCESS(APFCON1,3)
// APFCON1<SDOSEL>
extern volatile __bit                   SDOSEL              __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 SDOSEL_bit          _BIT_ACCESS(APFCON1,5)
// SSP1CON2<SEN>
extern volatile __bit                   SEN                 __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// SLRCONA<SLRCONA0>
extern volatile __bit                   SLRCONA0            __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRCONA0_bit        _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRCONA1>
extern volatile __bit                   SLRCONA1            __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRCONA1_bit        _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRCONA2>
extern volatile __bit                   SLRCONA2            __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRCONA2_bit        _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRCONA3>
extern volatile __bit                   SLRCONA3            __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 SLRCONA3_bit        _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRCONA4>
extern volatile __bit                   SLRCONA4            __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRCONA4_bit        _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRCONA5>
extern volatile __bit                   SLRCONA5            __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRCONA5_bit        _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRCONA6>
extern volatile __bit                   SLRCONA6            __at(0x1866);	// @ (0x30C * 8 + 6)
#define                                 SLRCONA6_bit        _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRCONA7>
extern volatile __bit                   SLRCONA7            __at(0x1867);	// @ (0x30C * 8 + 7)
#define                                 SLRCONA7_bit        _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRCONB0>
extern volatile __bit                   SLRCONB0            __at(0x1868);	// @ (0x30D * 8 + 0)
#define                                 SLRCONB0_bit        _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRCONB1>
extern volatile __bit                   SLRCONB1            __at(0x1869);	// @ (0x30D * 8 + 1)
#define                                 SLRCONB1_bit        _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRCONB2>
extern volatile __bit                   SLRCONB2            __at(0x186A);	// @ (0x30D * 8 + 2)
#define                                 SLRCONB2_bit        _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRCONB3>
extern volatile __bit                   SLRCONB3            __at(0x186B);	// @ (0x30D * 8 + 3)
#define                                 SLRCONB3_bit        _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRCONB4>
extern volatile __bit                   SLRCONB4            __at(0x186C);	// @ (0x30D * 8 + 4)
#define                                 SLRCONB4_bit        _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRCONB5>
extern volatile __bit                   SLRCONB5            __at(0x186D);	// @ (0x30D * 8 + 5)
#define                                 SLRCONB5_bit        _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRCONB6>
extern volatile __bit                   SLRCONB6            __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 SLRCONB6_bit        _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRCONB7>
extern volatile __bit                   SLRCONB7            __at(0x186F);	// @ (0x30D * 8 + 7)
#define                                 SLRCONB7_bit        _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRCONC0>
extern volatile __bit                   SLRCONC0            __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 SLRCONC0_bit        _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRCONC1>
extern volatile __bit                   SLRCONC1            __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SLRCONC1_bit        _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRCONC2>
extern volatile __bit                   SLRCONC2            __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SLRCONC2_bit        _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRCONC3>
extern volatile __bit                   SLRCONC3            __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 SLRCONC3_bit        _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRCONC4>
extern volatile __bit                   SLRCONC4            __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 SLRCONC4_bit        _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRCONC5>
extern volatile __bit                   SLRCONC5            __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SLRCONC5_bit        _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRCONC6>
extern volatile __bit                   SLRCONC6            __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 SLRCONC6_bit        _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRCONC7>
extern volatile __bit                   SLRCONC7            __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 SLRCONC7_bit        _BIT_ACCESS(SLRCONC,7)
// SLRCOND<SLRCOND0>
extern volatile __bit                   SLRCOND0            __at(0x1878);	// @ (0x30F * 8 + 0)
#define                                 SLRCOND0_bit        _BIT_ACCESS(SLRCOND,0)
// SLRCOND<SLRCOND1>
extern volatile __bit                   SLRCOND1            __at(0x1879);	// @ (0x30F * 8 + 1)
#define                                 SLRCOND1_bit        _BIT_ACCESS(SLRCOND,1)
// SLRCOND<SLRCOND2>
extern volatile __bit                   SLRCOND2            __at(0x187A);	// @ (0x30F * 8 + 2)
#define                                 SLRCOND2_bit        _BIT_ACCESS(SLRCOND,2)
// SLRCOND<SLRCOND3>
extern volatile __bit                   SLRCOND3            __at(0x187B);	// @ (0x30F * 8 + 3)
#define                                 SLRCOND3_bit        _BIT_ACCESS(SLRCOND,3)
// SLRCOND<SLRCOND4>
extern volatile __bit                   SLRCOND4            __at(0x187C);	// @ (0x30F * 8 + 4)
#define                                 SLRCOND4_bit        _BIT_ACCESS(SLRCOND,4)
// SLRCOND<SLRCOND5>
extern volatile __bit                   SLRCOND5            __at(0x187D);	// @ (0x30F * 8 + 5)
#define                                 SLRCOND5_bit        _BIT_ACCESS(SLRCOND,5)
// SLRCOND<SLRCOND6>
extern volatile __bit                   SLRCOND6            __at(0x187E);	// @ (0x30F * 8 + 6)
#define                                 SLRCOND6_bit        _BIT_ACCESS(SLRCOND,6)
// SLRCOND<SLRCOND7>
extern volatile __bit                   SLRCOND7            __at(0x187F);	// @ (0x30F * 8 + 7)
#define                                 SLRCOND7_bit        _BIT_ACCESS(SLRCOND,7)
// SLRCONE<SLRCONE0>
extern volatile __bit                   SLRCONE0            __at(0x1880);	// @ (0x310 * 8 + 0)
#define                                 SLRCONE0_bit        _BIT_ACCESS(SLRCONE,0)
// SLRCONE<SLRCONE1>
extern volatile __bit                   SLRCONE1            __at(0x1881);	// @ (0x310 * 8 + 1)
#define                                 SLRCONE1_bit        _BIT_ACCESS(SLRCONE,1)
// SLRCONE<SLRCONE2>
extern volatile __bit                   SLRCONE2            __at(0x1882);	// @ (0x310 * 8 + 2)
#define                                 SLRCONE2_bit        _BIT_ACCESS(SLRCONE,2)
// SSP1STAT<SMP>
extern volatile __bit                   SMP                 __at(0x10A7);	// @ (0x214 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSP1STAT,7)
// RC1STA<SPEN>
extern volatile __bit                   SPEN                __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RC1STA,7)
// OSCCON<SPLLEN>
extern volatile __bit                   SPLLEN              __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 SPLLEN_bit          _BIT_ACCESS(OSCCON,7)
// RC1STA<SREN>
extern volatile __bit                   SREN                __at(0xCED);	// @ (0x19D * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RC1STA,5)
// SSP1ADD<SSP1ADD0>
extern volatile __bit                   SSP1ADD0            __at(0x1090);	// @ (0x212 * 8 + 0)
#define                                 SSP1ADD0_bit        _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<SSP1ADD1>
extern volatile __bit                   SSP1ADD1            __at(0x1091);	// @ (0x212 * 8 + 1)
#define                                 SSP1ADD1_bit        _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<SSP1ADD2>
extern volatile __bit                   SSP1ADD2            __at(0x1092);	// @ (0x212 * 8 + 2)
#define                                 SSP1ADD2_bit        _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<SSP1ADD3>
extern volatile __bit                   SSP1ADD3            __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 SSP1ADD3_bit        _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<SSP1ADD4>
extern volatile __bit                   SSP1ADD4            __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 SSP1ADD4_bit        _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<SSP1ADD5>
extern volatile __bit                   SSP1ADD5            __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 SSP1ADD5_bit        _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<SSP1ADD6>
extern volatile __bit                   SSP1ADD6            __at(0x1096);	// @ (0x212 * 8 + 6)
#define                                 SSP1ADD6_bit        _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<SSP1ADD7>
extern volatile __bit                   SSP1ADD7            __at(0x1097);	// @ (0x212 * 8 + 7)
#define                                 SSP1ADD7_bit        _BIT_ACCESS(SSP1ADD,7)
// SSP1BUF<SSP1BUF0>
extern volatile __bit                   SSP1BUF0            __at(0x1088);	// @ (0x211 * 8 + 0)
#define                                 SSP1BUF0_bit        _BIT_ACCESS(SSP1BUF,0)
// SSP1BUF<SSP1BUF1>
extern volatile __bit                   SSP1BUF1            __at(0x1089);	// @ (0x211 * 8 + 1)
#define                                 SSP1BUF1_bit        _BIT_ACCESS(SSP1BUF,1)
// SSP1BUF<SSP1BUF2>
extern volatile __bit                   SSP1BUF2            __at(0x108A);	// @ (0x211 * 8 + 2)
#define                                 SSP1BUF2_bit        _BIT_ACCESS(SSP1BUF,2)
// SSP1BUF<SSP1BUF3>
extern volatile __bit                   SSP1BUF3            __at(0x108B);	// @ (0x211 * 8 + 3)
#define                                 SSP1BUF3_bit        _BIT_ACCESS(SSP1BUF,3)
// SSP1BUF<SSP1BUF4>
extern volatile __bit                   SSP1BUF4            __at(0x108C);	// @ (0x211 * 8 + 4)
#define                                 SSP1BUF4_bit        _BIT_ACCESS(SSP1BUF,4)
// SSP1BUF<SSP1BUF5>
extern volatile __bit                   SSP1BUF5            __at(0x108D);	// @ (0x211 * 8 + 5)
#define                                 SSP1BUF5_bit        _BIT_ACCESS(SSP1BUF,5)
// SSP1BUF<SSP1BUF6>
extern volatile __bit                   SSP1BUF6            __at(0x108E);	// @ (0x211 * 8 + 6)
#define                                 SSP1BUF6_bit        _BIT_ACCESS(SSP1BUF,6)
// SSP1BUF<SSP1BUF7>
extern volatile __bit                   SSP1BUF7            __at(0x108F);	// @ (0x211 * 8 + 7)
#define                                 SSP1BUF7_bit        _BIT_ACCESS(SSP1BUF,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// SSP1MSK<SSP1MSK0>
extern volatile __bit                   SSP1MSK0            __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 SSP1MSK0_bit        _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<SSP1MSK1>
extern volatile __bit                   SSP1MSK1            __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 SSP1MSK1_bit        _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<SSP1MSK2>
extern volatile __bit                   SSP1MSK2            __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 SSP1MSK2_bit        _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<SSP1MSK3>
extern volatile __bit                   SSP1MSK3            __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 SSP1MSK3_bit        _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<SSP1MSK4>
extern volatile __bit                   SSP1MSK4            __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 SSP1MSK4_bit        _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<SSP1MSK5>
extern volatile __bit                   SSP1MSK5            __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 SSP1MSK5_bit        _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<SSP1MSK6>
extern volatile __bit                   SSP1MSK6            __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 SSP1MSK6_bit        _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<SSP1MSK7>
extern volatile __bit                   SSP1MSK7            __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 SSP1MSK7_bit        _BIT_ACCESS(SSP1MSK,7)
// SSP1CON1<SSPEN>
extern volatile __bit                   SSPEN               __at(0x10AD);	// @ (0x215 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSP1CON1,5)
// SSP1CON1<SSPM0>
extern volatile __bit                   SSPM0               __at(0x10A8);	// @ (0x215 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSP1CON1,0)
// SSP1CON1<SSPM1>
extern volatile __bit                   SSPM1               __at(0x10A9);	// @ (0x215 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSP1CON1,1)
// SSP1CON1<SSPM2>
extern volatile __bit                   SSPM2               __at(0x10AA);	// @ (0x215 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSP1CON1,2)
// SSP1CON1<SSPM3>
extern volatile __bit                   SSPM3               __at(0x10AB);	// @ (0x215 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSP1CON1,3)
// SSP1CON1<SSPOV>
extern volatile __bit                   SSPOV               __at(0x10AE);	// @ (0x215 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSP1CON1,6)
// PCON<STKOVF>
extern volatile __bit                   STKOVF              __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON,7)
// PCON<STKUNF>
extern volatile __bit                   STKUNF              __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON,6)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// TX1STA<SYNC>
extern volatile __bit                   SYNC                __at(0xCF4);	// @ (0x19E * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TX1STA,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_bit           _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0xC8);	// @ (0x19 * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0xC9);	// @ (0x19 * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0xCD);	// @ (0x19 * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0xCA);	// @ (0x19 * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T1CON<T1OSCEN>
extern volatile __bit                   T1OSCEN             __at(0xC3);	// @ (0x18 * 8 + 3)
#define                                 T1OSCEN_bit         _BIT_ACCESS(T1CON,3)
// OSCSTAT<T1OSCR>
extern volatile __bit                   T1OSCR              __at(0x4D7);	// @ (0x9A * 8 + 7)
#define                                 T1OSCR_bit          _BIT_ACCESS(OSCSTAT,7)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,0)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0xE1);	// @ (0x1C * 8 + 1)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,3)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0xE4);	// @ (0x1C * 8 + 4)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,4)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0xE5);	// @ (0x1C * 8 + 5)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,5)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0xE6);	// @ (0x1C * 8 + 6)
#define                                 T2OUTPS3_bit        _BIT_ACCESS(T2CON,6)
// OPTION_REG<TMR0CS>
extern volatile __bit                   TMR0CS              __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 TMR0CS_bit          _BIT_ACCESS(OPTION_REG,5)
// INTCON<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 TMR0IE_bit          _BIT_ACCESS(INTCON,5)
// INTCON<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 TMR0IF_bit          _BIT_ACCESS(INTCON,2)
// OPTION_REG<TMR0SE>
extern volatile __bit                   TMR0SE              __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 TMR0SE_bit          _BIT_ACCESS(OPTION_REG,4)
// T1CON<TMR1CS0>
extern volatile __bit                   TMR1CS0             __at(0xC6);	// @ (0x18 * 8 + 6)
#define                                 TMR1CS0_bit         _BIT_ACCESS(T1CON,6)
// T1CON<TMR1CS1>
extern volatile __bit                   TMR1CS1             __at(0xC7);	// @ (0x18 * 8 + 7)
#define                                 TMR1CS1_bit         _BIT_ACCESS(T1CON,7)
// T1GCON<TMR1GE>
extern volatile __bit                   TMR1GE              __at(0xCF);	// @ (0x19 * 8 + 7)
#define                                 TMR1GE_bit          _BIT_ACCESS(T1GCON,7)
// PIE1<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE1,7)
// PIR1<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x8F);	// @ (0x11 * 8 + 7)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR1,7)
// PIE1<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x88);	// @ (0x11 * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR1,0)
